[
    {
        "id": "1b3c3ej",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "Dell shares soar 20% after beating earnings expectations, cites rising demand for AI servers",
        "selftext": "Shares of Dell Technologies popped more than 18% in extended trading Thursday after the company released fourth-quarter results that beat analysts’ estimates on top and bottom lines.\n\nHere’s how the company did:\n\nEarnings per share: $2.20 adjusted vs. $1.73 expected by LSEG, formerly known as Refinitiv\n\nRevenue: $22.32 billion vs. $22.16 billion expected by LSEG\n\nDell’s revenue for the fourth quarter fell 11% from $25.04 billion in the year ago quarter. The company reported a net income $1.16 billion, up 89% from the $614 million it posted in the same period last year.\n\nSource: https://www.cnbc.com/2024/02/29/dell-shares-soar-20percent-after-beating-earnings-expectations-cites-rising-demand-for-ai-servers.html",
        "created": "2024-02-29",
        "num_comments": 103,
        "ups": 316,
        "downs": 0,
        "score": 316,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b3c3ej/dell_shares_soar_20_after_beating_earnings/"
    },
    {
        "id": "1b31nk9",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "Key Fed inflation measure rose 0.4% in January as expected, up 2.8% from a year ago",
        "selftext": "[https://www.cnbc.com/2024/02/29/pce-inflation-january-2023-.html](https://www.cnbc.com/2024/02/29/pce-inflation-january-2023-.html)\n\nInflation rose in line with expectations in January, according to an important gauge the Federal Reserve uses as it deliberates cutting interest rates.\r  \n\r  \nThe personal consumption expenditures price index excluding food and energy costs increased 0.4% for the month and 2.8% from a year ago, as expected according to the Dow Jones consensus estimates.\r  \n\r  \nHeadline PCE, including the volatile food and energy categories, increased 0.3% monthly and 2.4% on a 12-month basis, compared with respective estimates for 0.3% and 2.4%, according to the numbers released Thursday by the Commerce Department’s Bureau of Economic Analysis.\r  \n\r  \nThe moves came amid an unexpected jump in personal income, which rose 1%, well above the forecast for 0.3%. Spending decreased 0.1% versus the estimate for a 0.2% gain.\r  \n\r  \nJanuary’s price rises reflected an ongoing shift to services over goods as the economy normalizes from the Covid pandemic disruptions.\r  \n\r  \nServices prices increased 0.6% on the month while goods fell 0.2%; on a 12-month basis, services rose 3.9% and goods were down 0.5%. Within those categories, food prices accelerated 0.5%, offset by a 1.4% slide in energy. On a year-over-year basis, food was up 1.4% while energy fell 4.9%.\r  \n\r  \nBoth the headline and core measures remain ahead of the Fed’s goal for 2% annual inflation. While the Fed officially uses the headline measure, policymakers tend to pay more attention to core as a better indication of where long-term trends are heading.\r  \n\r  \nWall Street reacted little to the news, with stock market futures up slightly and Treasury yields slightly higher. Futures markets where traders bet on the direction of interest rates also indicated little movement, with pricing tilted toward the Fed’s first rate cut coming in June.\r  \n\r  \n“Overall, \\[the report\\] is meeting the expectations, and some of the worst fears in the market weren’t met,” said Stephen Gallagher, chief U.S. economist at Société Générale. “The key is we’re not seeing the broad nature of increases that we had been more fearful of.”\r  \n\r  \nThursday’s BEA report also showed that consumers are continuing to dip into savings as prices stay elevated. The personal savings rate was 3.8% on the month, slightly higher than December but off a full percentage point from where it was as recently as June 2023.\r  \n\r  \nIn other economic news, a Labor Department report showed that companies are still reluctant to lay off workers.\r  \n\r  \nInitial jobless claims totaled 215,000 for the week ended Feb. 24, up 13,000 from the previous period and more than the 210,000 Dow Jones estimate but still largely in keeping with recent trends. However, continuing claims, which run a week behind, rose to just above 1.9 million, a gain of 45,000 and higher than the FactSet estimate for 1.88 million.\r  \n\r  \nThe reports come as central bank officials mull the future of monetary policy following 11 interest rate increases totaling 5.25 percentage points. Running from March 2022 to July 2023, the hikes came as the Fed battled inflation that peaked at a more than 40-year high in mid-2022.\r  \n\r  \nOfficials have said in recent days that they expect to begin reversing the increases at some point this year. However, the timing and extent of the policy easing is uncertain as recent data has indicated that inflation could be more stubborn than expected.\r  \n\r  \nJanuary’s consumer price index data raised fears of persistently high inflation, though many economists saw the rise as impacted by seasonal factors and shelter increases unlikely to persist.\r  \n\r  \nWhile the CPI is used as an input to the PCE, Fed officials focus more on the latter as it adjusts for substitutions consumers make for goods and services as prices fall. Where the CPI is viewed as a simpler price measure, the PCE is viewed as more representative of what people are actually buying",
        "created": "2024-02-29",
        "num_comments": 136,
        "ups": 249,
        "downs": 0,
        "score": 249,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b31nk9/key_fed_inflation_measure_rose_04_in_january_as/"
    },
    {
        "id": "1b3cejl",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "Shares of NYCB fall more than 10% after bank discloses 'internal controls' issue, CEO change",
        "selftext": "Shares of New York Community Bancorp fell 12% in extended trading Thursday after the regional lender announced a leadership change and disclosed issues with its internal controls.\n\nThe regional bank announced that Alessandro DiNello, its executive chairman, is taking on the roles of president and CEO, effective immediately. NYBC has been under pressure in recent months due in part to concerns about its exposure to commercial real estate.\n\nThe bank also announced its fourth quarter results, which included a disclosure about its internal risk management.\n\n“As part of management’s assessment of the Company’s internal controls, management identified material weaknesses in the Company’s internal controls related to internal loan review, resulting from ineffective oversight, risk assessment and monitoring activities,” the company said in a filing.\n\nSource: https://www.cnbc.com/2024/02/29/shares-of-nycb-fall-more-than-10percent-after-bank-discloses-internal-controls-issue-ceo-change.html",
        "created": "2024-02-29",
        "num_comments": 41,
        "ups": 204,
        "downs": 0,
        "score": 204,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b3cejl/shares_of_nycb_fall_more_than_10_after_bank/"
    },
    {
        "id": "1b31r82",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "Birkenstock beats revenue expectations on higher pricing, U.S. demand",
        "selftext": "Birkenstock on Thursday beat holiday quarter revenue expectations, reporting a 22% year-on-year jump, as the German sandal company benefited from higher pricing and rising U.S. demand.\n\nAs a newly public company, Birkenstock is still getting into a public reporting rhythm and only just released its fiscal 2023 results and 2024 guidance a little over a month ago. On Thursday, it said it stands by guidance issued then and still expects sales to be between 1.74 billion euros ($1.89 billion) and 1.76 billion euros ($1.91 billion), representing growth of 17% to 18%.\n\nHere’s how the shoemaker did in its first fiscal quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG, formerly known as Refinitiv:\n\nEarnings per share: 9 euro cents adjusted vs. 9 euro cents expected\n\nRevenue: 302.9 million euros vs. 288.7 million euros expected.\n\nThe company reported a net loss of 7.15 million euros ($7.75 million) for the three-month period that ended December 31, or a loss of 4 euro cents per share. A year earlier, it reported a loss of 9.19 million euros ($9.96 million), or a loss of 5 euro cents per share. Excluding one time items, Birkenstock reported a profit of 17 million euros ($18.4 million) or 9 euro cents per share.\n\nSales rose to 302.9 million euros ($328.5 million), up 22% from 248.5 million euros ($269.4 million) a year earlier.\n\nCEO Oliver Reichert has said the company deliberately engineers its distribution strategy so demand is higher than supply but its working to build out its production capabilities to narrow that gap. The chief executive said those investments, along with other efforts the company is undertaking to drive growth, is having a “planned” but “temporary” impact to profitability.\n\n“Our results for the first quarter of 2024 once again demonstrate the resilience of our business model and the strong sustained demand for our products. Given our engineered distribution model, demand continues to outpace supply in all regions, channels and categories,” said Reichert. “In the medium-term, we are confident we will continue to deliver our objectives of a gross profit margin over 60% and an adjusted EBITDA margin in the low thirties percent.”\n\nThe company’s gross profit margin inched down to 61% from 61.7% during the same period last year, with Birkenstock citing “unfavorable currency translation and the planned, temporary under-absorption from our ongoing capacity expansion.” The company said it continues to carefully track input costs and is mitigating inflationary pressures with “executed, selective price increases.”\n\nAdjusted earnings before interest, taxation, depreciation and amortization (EBITDA) rose 12% year-on-year to 81 million euros, with an adjusted EBITDA margin of 26.9%, down from 29.1% a year earlier.\n\nThe newly public shoemaker, which started trading on the New York Stock Exchange under the ticker “BIRK” in October, saw a muted debut when it first hit the public markets, with shares sliding more than 12% on its first day as a public company. Shares have since rebounded and are up more than 5% this year, as of the Wednesday close. \n\nIn January, the company reported its fiscal 2023 results and said it was the most successful year in the company’s nearly 250-year long history. Sales grew 20% and the retailer made strides in growing its direct-to-consumer business, which comes with better profits and more customer insights than relying on wholesale partners. \n\nDuring the quarter, Birkenstock saw more gains in its direct channels and said DTC sales accounted for 53% of overall revenue.\n\nAs other retailers like Nike, Under Armour and Timberland-owner VF Corp contend with soft demand in North America, Birkenstock reported outsized strength in the region with sales up 21% during fiscal 2023. That momentum continued during its fiscal first quarter with sales up 14% in the region. In Europe, where demand in some parts has been softer than in North America, sales grew 32%, and in the Asia Pacific, Middle East and Africa region, revenue jumped 47%.\n\nThe recent growth comes several years after private equity powerhouse L Catterton acquired a majority stake in Birkenstock in 2021, ending nearly 250 years of family ownership that began when German cobbler Johann Adam Birkenstock founded the company in 1774. \n\nBirkenstock’s new owners set off on an aggressive growth strategy that focused on growing direct-to-consumer sales, exiting certain wholesale partnerships and focusing on driving sales of items with higher price points. Within a few years, its sales nearly doubled and its market cap is now around $9.7 billion, double its 2021 valuation of $4.85 billion. \n\nSince going public, Birkenstock has used some of its proceeds to pay down debt. In the fall, it made a number of debt payments that reduced its net leverage. As of the end of December, Birkenstock was levered at 2.6 times EBITDA.\n\nSource: https://www.cnbc.com/2024/02/29/birkenstock-birk-earnings-q1-2024.html",
        "created": "2024-02-29",
        "num_comments": 18,
        "ups": 72,
        "downs": 0,
        "score": 72,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b31r82/birkenstock_beats_revenue_expectations_on_higher/"
    },
    {
        "id": "1b3kl34",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "Tesla stands to earn billions by opening U.S. chargers to drivers of Ford, other EVs",
        "selftext": "As of Thursday, owners of Ford electric vehicles — the Mustang Mach-E and F-150 Lightning — in North America finally have the ability to power up using Tesla Superchargers.\n\nFord CEO Jim Farley wrote in a post on LinkedIn that the charging partnership, which involves use of fast-charging adapters, should “improve the EV ownership experience,” for Ford EV drivers, noting that “I’ve tested it myself and its works great.”\n\nTesla has forged a similar agreement with General Motors, which was announced in June, giving GM customers access to more than 12,000 Tesla fast chargers in the U.S and Canada. GM CEO Mary Barra said at the time that her company expected to save up to $400 million of a planned investment in building out EV charging stations.\n\nThe partnerships mark a strategy shift for Tesla CEO Elon Musk, who for years touted the exclusivity of Tesla’s charging network and his company’s ability to build reliable charging locations that would keep consumers from sitting in long lines. Becoming the charging standard has required Tesla to invest heavily in technical and business development.\n\nBut Tesla has plenty to gain from working with others.\n\nSam Fiorani, vice president for global forecasting at AutoForecast Solutions, said these efforts should eventually yield huge financial benefits for Tesla, including from environmental credits and fees for charging sessions.\n\nCurrently, Tesla operates about one in three charging stations in the U.S. Even if adoption of battery electric vehicles slows domestically, and the fleet of electric vehicles is smaller than what the government and many automakers planned six months ago, “Tesla could still see $6 billion to $12 billion a year,” by 2030 from its expanded charging business, Fiorani said in an email.\n\nWhile Tesla could lose some customers to other brands by making charging easier, AutoForecast said there are other reasons car buyers flock to Tesla.\n\n“People shopping for a Tesla aren’t typically cross-shopping at Kia, Ford, or Mercedes-Benz dealers because they simply want a Tesla,” Fiorani wrote. “Competition will continue to heat up and Tesla will inevitably lose some sales to rivals, but loyalty to the brand means the vast majority of owners will return to Tesla with little or no comparison shopping.”\n\nAllowing other automakers to tap its charging network also opens up some federal money for Tesla under President Biden’s Inflation Reduction Act.\n\n“Tesla is not afraid to use government regulations for income and has been working all possible revenue streams for much of its existence,” Fiorani wrote.\n\nTesla didn’t respond to a request for further information.\n\nTesla reports charging revenue with its “Total automotive &amp; services and other segment revenue.” The company hasn’t said whether it may break out revenue from non-Tesla vehicle use of its charging network.\n\nWilliam Navarro Jameson, Tesla’s Strategic Charging Programs lead, wrote in a post on LinkedIn on Thursday that getting to this point with Ford has required a lot of “interoperability testing” along with creating all the necessary hardware and software integrations and working through legal issues.\n\n“There have been so many pieces to this puzzle that have been put in place over the past 18 months,” he wrote.\n\nOn social media, Tesla touted the opening up of its charging network in North America and circulated a link to entice more retailers to host Superchargers at their facilities.\n\nSource: https://www.cnbc.com/2024/02/29/tesla-to-earn-billions-from-charging-partnerships-with-ford-others.html",
        "created": "2024-03-01",
        "num_comments": 26,
        "ups": 68,
        "downs": 0,
        "score": 68,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b3kl34/tesla_stands_to_earn_billions_by_opening_us/"
    },
    {
        "id": "1b34soy",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "Starbucks, Workers United union agree to start collective bargaining, contract discussions",
        "selftext": "Likely bullish for SBUX share price and market seems to have a positive reaction thus far.  I was beginning to think the standstill would slowly damage their brand over time.  Also union efforts only seem to be growing over time at SBUX chains (at least US) so ignoring it and sweeping it under the rug doesn't seem like a smart solution.  Getting a contract signed is probably in the interest of all parties including shareholders.\n\nhttps://www.msn.com/en-us/money/companies/starbucks-workers-united-union-agree-to-start-collective-bargaining-contract-discussions/ar-BB1j3vw8\n\n&gt;Starbucks announced Tuesday that it will begin discussing potential collective bargaining agreements with the labor union representing nearly 10,000 employees from around 400 stores.\n\n&gt;The coffeehouse chain's decision comes nearly three years after Workers United, an American and Canadian labor union, initially organized baristas at a Starbucks in Buffalo, New York.\n\n&gt;\"Starbucks and Workers United have a shared commitment to establishing a positive relationship in the interests of Starbucks partners,\" Starbucks said Tuesday in a statement. \"During mediation discussions last week for the ongoing brand and IP litigation, it became clear that there was a constructive path forward on the broader issue of the future of organizing and collective bargaining at Starbucks.\"\n\n&gt;In addition to opening up discussions, \"as a sign of good faith,\" Starbucks agreed to allow employees represented by Workers United to receive credit card tips from customers and other benefits, which the company announced in May 2022, according to Starbucks' statement.\n\n&gt;\"While there is plenty of work ahead, coming together to develop this framework is a significant step forward and a clear demonstration of a shared commitment to working collaboratively and with mutual respect,\" Workers United said in a statement. \n\n&gt;**Starbucks, Workers United relationship taking turn for the better**\n\n&gt;Starbucks and the union's relationship began going in the right direction in December 2023 when the company sent a letter to Workers United as an \"attempt to propose a path forward that would allow us to resume productive contract negotiations.\"\n\n&gt;\"We collectively agree, the current impasse should not be acceptable to either of us,\" Starbucks said in the letter. \"It has not helped Starbucks, Workers United or, most importantly, our partners. In this spirit, we are asking for your support and agreement to restart bargaining.\" \n\n&gt;**Pending lawsuit between Starbucks, Workers United**\n\n&gt;Despite efforts to improve the relationship, both sides still have \"outstanding litigation,\" which Starbucks said Tuesday it hopes to resolve with the labor union.\n\n&gt;The company sued Workers United in October 2023 over pro-Palestinian social media posts shared by the union's account, which angered hundreds of Starbucks customers, put other employees' safety at risk and blemished the chain's reputation, according to court records. Starbucks filed the suit in the Southern District of Iowa.\n\n&gt;The company also sued over Workers United's \"unauthorized use of the famous Starbucks name and logos that copy the famous Starbucks logos,\" court records show. The company accused the union of using \"copycat logos\" to promote fundraising, sell merchandise and falsely promote political and social topics on behalf of Starbucks. \n\n&gt;Starbucks requested a jury trial and permanent injunctive relief prohibiting the union from using logos similar to theirs, court documents show.\n\n&gt;Workers United countersued against Starbucks in a Pennsylvania federal court and requested that the union be able to use Starbucks' name and similar logos, according to court records. Workers United also accuses Starbucks of defaming the union by associating them with terrorism. \n\n&gt;**Starbucks announced pay raise, Workers United planned 'Red Cup Rebellion'**\n\n\n\n&gt;After filing the suit, Starbucks announced in November 2023 that it would increase hourly wages and benefits for most U.S. workers. The pay raise came after the company had a fiscal year with record sales, according to a statement by Starbucks.\n\n&gt;During the same month, Workers United planned a strike that led to thousands of Starbucks employees at hundreds of locations walking out during Red Cup Day. The union-coined \"Red Cup Rebellion\" stemmed from claims that Starbucks was \"illegally refusing to bargain with baristas over staffing, scheduling and other issues,\" Workers United said in a news release.\n\n&gt;\"Promotion days like Red Cup Day, half-off ThursYays and Buy One Get One Free offers cause a flood of customers to stores without any additional staffing to cover the influx of orders,\" the union said in the release.",
        "created": "2024-02-29",
        "num_comments": 13,
        "ups": 41,
        "downs": 0,
        "score": 41,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b34soy/starbucks_workers_united_union_agree_to_start/"
    },
    {
        "id": "1b2yljb",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "Who do you watch?",
        "selftext": "Since Bloomberg is wanting to cover politics on surveillance and the terrible screen burn inducing 1990s frames format, I’m watching it less now.  I can’t stand Joe Kernen on CNBC, so haven’t watched that in years.  What else is there for morning finance?",
        "created": "2024-02-29",
        "num_comments": 48,
        "ups": 37,
        "downs": 0,
        "score": 37,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b2yljb/who_do_you_watch/"
    },
    {
        "id": "1b3kc05",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "Why is the Japan stock market going up when its economic is doing very bad? What Am I missing?",
        "selftext": "\\- Japan  slipped into a recession at the end of last year, losing its title as the world's third-biggest economy to Germany.\n\n\\- Japan factory output falls at the fastest pace in nearly four years. Industrial output fell 7.5% in January 2024 from the previous month, data from the Ministry of Economy, Trade and Industry showed. \n\n\\- \"The plunge in industrial production in January suggests that GDP will fall yet again this quarter, which will add to the view that Japan's economy is in recession,\" said Gabriel Ng, assistant economist at Capital Economics.  \n\\- Production declined the most in motor vehicles, down 17.8% in January from the previous month. Output decreases in regular passenger cars and electrical drives systems pulled down the overall figures.\n\n\\- Birth rate reached to historically low last year. And the administrative even says that if they don't reverse this by 2030. There is no turning back but nose-diving crash. \n\nAnd now, Warren Buffet in his annual letter claiming that he will keep holding and buying more Japanese stock for indefinite period of time as he already hold 8.5% across the group of top five firms. Buffett had previously expressed caution about investing in foreign companies, citing his inability to forecast foreign-exchange movements. Despite this, he has shown a clear interest in Japan’s economy. And he has been praising about Japan future economic several occasions now.\n\nThis is not some speculative movement, He's talking about long-long term investment like 10+ years. I just can't understand how can someone be optimistic about Japan economic given its aging population, birth rate, and recently performance. \n\n&amp;#x200B;",
        "created": "2024-03-01",
        "num_comments": 60,
        "ups": 45,
        "downs": 0,
        "score": 45,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b3kc05/why_is_the_japan_stock_market_going_up_when_its/"
    },
    {
        "id": "1b3cqy5",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "FSLR is a gem mixed in with some terrible solar companies",
        "selftext": "I really don't understand why people are so excited about $ENPH when there is another company actually PRINTING MONEY hand over fist FIRST SOLAR $FSLR is the WINNER.  \n\n\n$FSLR is utility scale solar and not rooftop solar which is the segment been facing interest rate pressure.\n\nValuation Metrics: First Solar currently trades at a lower trailing P/E ratio (19.28) compared to Enphase (38.67), indicating that it may be undervalued relative to its earnings. Furthermore, First Solar's forward P/E for 2024 is significantly lower (11.31) than Enphase's (38.61), suggesting that First Solar may offer better future earnings potential at a more attractive price.  \n\n\nAnalyst Price Targets: Analysts have a bullish outlook on First Solar, with an average price target of $223.28, representing a substantial upside potential of approximately 45% from the current price. In contrast, Enphase's average price target of $131.74 implies a more modest upside of about 3.7%. If First Solar were to be trading at a similar Trailing P/E of 38.67 that would put their share price at $299.30 or about a 94% upside.  \n\n\nMarket Position and Demand: First Solar has established itself as a leader in utility-scale solar projects, with a remarkable achievement of being completely sold out through 2026. This strong demand underscores the company's ability to secure long-term contracts and generate steady revenue streams. The company's recent earnings report demonstrated its resilience to interest rate fluctuations, further highlighting its ability to maintain stable revenue amidst changing market conditions. With a robust backlog of orders and a clear path to future growth, First Solar is well-positioned to capitalize on the increasing demand for renewable energy solutions.  \n\n\nRisk Factors: While both companies face regulatory and policy risks inherent to the renewable energy sector, First Solar's exposure to potential policy changes is mitigated by its diversified customer base and long-term contracts. Additionally, the company benefits from tax credits that support its growth initiatives, providing a buffer against regulatory uncertainties. First Solar is also largely immune to interest rate volatility as seen in their most recent earnings.\n\nEconomies of Scale and  Competitive Advantage: First Solar's focus on utility-scale solar production allows it to benefit from economies of scale and cost efficiencies that are difficult for competitors to replicate. With a strong emphasis on innovation and technological advancements, First Solar is well-positioned to maintain its competitive edge in the market  \n\n\n.First Solar has an average analyst EPS target for 2025 of about $21, that means they are trading at 7.3x 2025 earnings which is INSANE. Even if the tax credits stopped in 2025, which again is highly unlikely, they would still be generating EPS of approximately $14, putting them at 11x 2025 forward earnings (non-tax subsidized earnings). The inflation reduction act allows First Solar to create a moat that will be almost impossible to cross in the future. Come on people, open your eyes and realize you can shoot fish in a barrel or chase nonsense.Literally all you have to do is take two minutes and go to yahoo finance and look at the numbers. Just compare them, and you will see that this is a stock that's being largely overlooked.",
        "created": "2024-02-29",
        "num_comments": 33,
        "ups": 32,
        "downs": 0,
        "score": 32,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b3cqy5/fslr_is_a_gem_mixed_in_with_some_terrible_solar/"
    },
    {
        "id": "1b2x8gt",
        "subreddit": "stocks",
        "upload_date": "2024-02-29",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Feb 29, 2024",
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n* Writing options switches the obligation to you and you'll be forced to buy someone else's shares (writing puts) or sell your shares (writing calls)\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "created": "2024-02-29",
        "num_comments": 374,
        "ups": 18,
        "downs": 0,
        "score": 18,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b2x8gt/rstocks_daily_discussion_options_trading_thursday/"
    },
    {
        "id": "1b34zqf",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "350k -&gt; 1.5mil, $SNOW puts",
        "selftext": "",
        "created": "2024-02-29",
        "num_comments": 412,
        "ups": 2520,
        "downs": 0,
        "score": 2520,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b34zqf/350k_15mil_snow_puts/"
    },
    {
        "id": "1b3alk2",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "Snowflake stock lost 18% today. Its CEO sold shares worth $223 mln during last 3 months.",
        "selftext": "",
        "created": "2024-02-29",
        "num_comments": 215,
        "ups": 1571,
        "downs": 0,
        "score": 1571,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b3alk2/snowflake_stock_lost_18_today_its_ceo_sold_shares/"
    },
    {
        "id": "1b31yoo",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "$Snowman is back",
        "selftext": "Decided for the first time to try some cheap puts. I’ve been buying calls from Nov 1st to Jan (140-210) I missed the run from 210 to 238. When the ceo of panw said there clients are facing spending exhaustion I knew it was the case at a few other companies. Bought 5 minutes before close yesterday. I did not expect the figurde head who everyone loved to resign, got lucky there. I did buy some deep itm calls this morning as well. I think the new ceo will do good especially coming from Google. Sold both puts this morning.",
        "created": "2024-02-29",
        "num_comments": 217,
        "ups": 1338,
        "downs": 0,
        "score": 1338,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b31yoo/snowman_is_back/"
    },
    {
        "id": "1b3c9al",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "Most Anticipated Earnings Releases for the week beginning March 4th, 2024",
        "selftext": "",
        "created": "2024-02-29",
        "num_comments": 680,
        "ups": 1265,
        "downs": 0,
        "score": 1265,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b3c9al/most_anticipated_earnings_releases_for_the_week/"
    },
    {
        "id": "1b3h5g4",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "Oprah has left WeightWatchers, sending stocks spiraling and spelling doom for the diet of our foremothers",
        "selftext": "",
        "created": "2024-03-01",
        "num_comments": 161,
        "ups": 1108,
        "downs": 0,
        "score": 1108,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b3h5g4/oprah_has_left_weightwatchers_sending_stocks/"
    },
    {
        "id": "1b2sx4q",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "I’m back to 0",
        "selftext": "I hope I win an award for most disgusting chart. Blew up my account so many times but never gave up. ",
        "created": "2024-02-29",
        "num_comments": 203,
        "ups": 1005,
        "downs": 0,
        "score": 1005,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b2sx4q/im_back_to_0/"
    },
    {
        "id": "1b3bg92",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "Apple stock hits 4-month low after scrapping $100,000 EV project",
        "selftext": "",
        "created": "2024-02-29",
        "num_comments": 176,
        "ups": 873,
        "downs": 0,
        "score": 873,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b3bg92/apple_stock_hits_4month_low_after_scrapping/"
    },
    {
        "id": "1b2sppm",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "Tomorrow will be a great day for bulls",
        "selftext": "I am an econometrician (and think quantity of money theory is right much of the time).\n\nMoney supply goes up, inflation tends to go up haef.\n\nM2 money supply data just dropped from FRED yesterday for January, and the good news is:\n\n* Once the money supply contracts (% change MoM), it continues to contract for no less than 3 months following.\n* Money supply has started to contract in January. I am betting on the PCE read to be bullish.\n* It could also go up marginally, but I put those odds lower than a drop.\n* Over a large sample (80 months) I find inverse correlation of -.44.\n\nGood luck!\n\nhttps://preview.redd.it/14jpisw2oglc1.png?width=772&amp;format=png&amp;auto=webp&amp;s=675500734e971bd51fcc772937b1737df7a6baef\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created": "2024-02-29",
        "num_comments": 314,
        "ups": 798,
        "downs": 0,
        "score": 798,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b2sppm/tomorrow_will_be_a_great_day_for_bulls/"
    },
    {
        "id": "1b3afsn",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "Too late, too early, always the wrong timing",
        "selftext": "",
        "created": "2024-02-29",
        "num_comments": 47,
        "ups": 625,
        "downs": 0,
        "score": 625,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b3afsn/too_late_too_early_always_the_wrong_timing/"
    },
    {
        "id": "1b2ysg4",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-29",
        "title": "It's earnings season, you know what that means",
        "selftext": "",
        "created": "2024-02-29",
        "num_comments": 36,
        "ups": 579,
        "downs": 0,
        "score": 579,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b2ysg4/its_earnings_season_you_know_what_that_means/"
    },
    {
        "id": "1b36b47",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "French CPI jumps 0.8% in Februari! Germany adds 0.4%.",
        "selftext": "While today US PCE numbers were released for the month of Januari, in Europe they already have numbers for this month so Februari.\n\nFrench CPI jumped a whopping 0.8% (!) this month, while Germany sees inflation going up 0.4% in Februari. \n\nSo just like the Fed, the ECB most likely will hold off on any rate cutting.\n\nTomorrow we will also get inflation numbers for Italy and the Eurozone as a whole but given the weight of France and Germany we already can tell it will be a hot number.\n\nYou can find all the numbers here: [https://www.investing.com/economic-calendar/](https://www.investing.com/economic-calendar/) \n\n&amp;#x200B;",
        "created": "2024-02-29",
        "num_comments": 9,
        "ups": 62,
        "downs": 0,
        "score": 62,
        "permalink": "https://www.reddit.com/r/investing/comments/1b36b47/french_cpi_jumps_08_in_februari_germany_adds_04/"
    },
    {
        "id": "1b3g26z",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "[Anecdotal Discussion] Is anyone else seeing an explosion of commercial real estate for sale in their area?",
        "selftext": "I live in a small North-Eastern U.S. city and recently began noticing a massive amount of commercial real estate for sale or lease in my area. The majority are, of course, office buildings. Now that I've been really paying attention, I'm realizing there just how many buildings are up for sale and sitting without occupants.\n\nThe fact that all of this commercial space is available indicates to me that there is a rush to the exits and that none of these buildings are bringing in enough revenue to cover the bills. With the NYCB situation, I worry that they may be the canary in the coal mine for commercial real estate hurting the most exposed banks. Which is a lot of them.\n\nI'm very curious to hear from others if they are seeing the same situation in their cities?",
        "created": "2024-03-01",
        "num_comments": 46,
        "ups": 38,
        "downs": 0,
        "score": 38,
        "permalink": "https://www.reddit.com/r/investing/comments/1b3g26z/anecdotal_discussion_is_anyone_else_seeing_an/"
    },
    {
        "id": "1b3d1ci",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "Why is mister Market allowing a 8% discount for a fund?",
        "selftext": "Currently the Liberty All-Star Growth Fund, Inc. (ASG) is being sold at a 8% discount. It's net asset value is 5.88$ per share, yet Mr. Market says that it's price is 5.41$.\n\nIs the market irrational or am I missing something here?\n\nI know that the fund has around 1.1% management fees, but this is on a yearly basis while the discount is happening on a daily basis. The fund also has 8% dividends. You could argue that the 8% dividends are the reason for the 8% difference in the market price, but you would be wrong, as again the dividend is paid on a quarter basis of just 2%, so it's again 6% free money till the next ex-dividend date. If the fund liquidate all it's assets the owners would have 8% of their investment's value for free - no dividend involved here, just pure liquidation of stocks, so no discount for selling physical assets etc. Besides giving out 8% of dividends is a good reason to value the fund higher than it's net value, no?\n\n[https://www.all-starfunds.com/asg](https://www.all-starfunds.com/asg)\n\nI know that the fund has been performing bad over the last year, but after all the net value is higher than the market price which seems like easy money.\n\nOne thing I don't understand is how is this fund is able to provide 8% dividends? It doesn't make sense due to the high diversification and the presence of stocks like Amazon in it - Amazon gives 0 dividends and many of the other holdings are giving out little dividends. MSFT like less than 1%. ",
        "created": "2024-02-29",
        "num_comments": 11,
        "ups": 17,
        "downs": 0,
        "score": 17,
        "permalink": "https://www.reddit.com/r/investing/comments/1b3d1ci/why_is_mister_market_allowing_a_8_discount_for_a/"
    },
    {
        "id": "1b3ec3v",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "Who do you see as the next big marketing automation IPO?",
        "selftext": "Marketing automation is crowded.\n\nLike 100+ solutions crowded.\n\n In terms of brands over $100m ARR it’s a smaller list (usually brands IPO around $200m ARR if their other financials are sound).\n\nHubSpot\n\nActiveCampaign\n\nMarketo (now part of Adobe)\n\nSalesforce Marketing Cloud (includes Pardot)\n\nMailchimp (now part of Intuit)\n\nKlaviyo\n\nBraze\n\nEloqua\n\nOne thing you find with SaaS is it's the brands that stick around for decades that really take off. If you have a strong NRR, magic happens over time. And being larger has a lot of advantages when it comes to being an email provider. More developed infrastructure, deliverability teams, access to big-data to provide AI-optimized experiences.\n\nRight now the market seems to be split between top enterprise tools (Marketo, Pardot, SMC etc), top mid-market tools (Hubspot, Braze) and top SMB focused tools (ActiveCampaign, Klaviyo).\n\nThe Klaviyo IPO was the first martech IPO in a bit and they seem to be doing well.\n\nAny marketing automation platforms you think are likely to IPO in 2024?",
        "created": "2024-02-29",
        "num_comments": 6,
        "ups": 11,
        "downs": 0,
        "score": 11,
        "permalink": "https://www.reddit.com/r/investing/comments/1b3ec3v/who_do_you_see_as_the_next_big_marketing/"
    },
    {
        "id": "1b30g11",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "Choosing Treasury Bills - how to choose offer price vs yields...",
        "selftext": "As the title asks - if looking at a TBill for a specific month, there are usually a few close together with slightly different offer price and yield listings... what is the best method to choose the one that will yield the best return for the time spent... or is it such a minor difference that it really doesn't matter much... - lets say 1Million in a ladder so this is just 250K for this rung... and reinvesting when it matures...\n\nExample:\n\nMaturity Date-----\tOffer Price-----\tYield To Worst\n\n3/21/2024-----\t\t99.7073\t-----\t5.381%\n\n3/26/2024-----\t\t99.6345\t-----\t5.370%\n\n3/19/2024-----\t\t99.7369\t-----\t5.367%\n\n3/28/2024-----\t\t99.6059\t-----\t5.364%\n\n&amp;#x200B;",
        "created": "2024-02-29",
        "num_comments": 7,
        "ups": 12,
        "downs": 0,
        "score": 12,
        "permalink": "https://www.reddit.com/r/investing/comments/1b30g11/choosing_treasury_bills_how_to_choose_offer_price/"
    },
    {
        "id": "1b3h2g9",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "Cash Sweep Yields Higher than 4.98%",
        "selftext": "I have a decent amount of money I would like to park in money market funds or deposit sweeps. I need the liquidity of something similar to cash so my options are limited. I can wait a week to liquidate the assets, but don't want to be exposed to market volatility. Fidelity's sweep is at 4.98% so I was wondering if anyone was earning higher sweep interest rates for balances of 15K USD. VMFXX has a 5.28% 7 day SEC yield, so right now that looks like the best choice.",
        "created": "2024-03-01",
        "num_comments": 6,
        "ups": 6,
        "downs": 0,
        "score": 6,
        "permalink": "https://www.reddit.com/r/investing/comments/1b3h2g9/cash_sweep_yields_higher_than_498/"
    },
    {
        "id": "1b37cn6",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "Why is USD value rising strong today? ",
        "selftext": "\nUSDX has shown a consistent performance of USD value the past four hours. Before that it costs less for GBP to be converted to USD.\n\nI was going to exchange GBP to USD and now I will need to wait until USD cools down.\n\nWhat’s going on today? Treasury’s price doesn’t have much volatility, nor does stock market. Why did USD suddenly got all this momentum? ",
        "created": "2024-02-29",
        "num_comments": 11,
        "ups": 4,
        "downs": 0,
        "score": 4,
        "permalink": "https://www.reddit.com/r/investing/comments/1b37cn6/why_is_usd_value_rising_strong_today/"
    },
    {
        "id": "1b3hkag",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "Does equity risk premium exist?",
        "selftext": "5 to 30 years TIPS are paying [a guaranteed 1.84% to 2.09% over inflation](https://www.bloomberg.com/markets/rates-bonds/government-bonds/us).    We can lock in 2% risk free real rates for the next 30 years.  Admittedly, some tax issues apply (non-cap-gains rates, we pay interest on inflation component) but those have always been there when computing ERP.\n\nSP500 yield computed as 1/PE is 3.66% (TTM PE) or 4% (forward looking PE).   So equity risk premium is 2% or lower.    4% is the historical norm.\n\nThis is  shown in [this 1-year outdated graph](https://aptuscapitaladvisors.com/wp-content/uploads/2023/03/12.-month-premium_Morgan-Stanley-2.28.23.png), or this [up to date curve using short-term T-bonds](https://twitter.com/Barchart/status/1753532511043326401/photo/1).\n\nWhy the current market enthusiasm, given the 2% TIPS safe harbor (or ordinary 4.5% treasuries if you prefer)?",
        "created": "2024-03-01",
        "num_comments": 6,
        "ups": 7,
        "downs": 0,
        "score": 7,
        "permalink": "https://www.reddit.com/r/investing/comments/1b3hkag/does_equity_risk_premium_exist/"
    },
    {
        "id": "1b3e2jt",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "How do equity titles like funds and ETF values keep up with their components' value?",
        "selftext": "I don't know where to ask that. I first thought about /r/AskScience, but there is no Economy flair/topic. I posted in /r/answers, but I fear not too many people with the financial knowledge will see it there. So I'm posting it here.\n\nI know how the value of stocks fluctuate according to what price buyers and sellers are agreeing on. But when you take funds that hold 10's, 100's and even 1000's of different stocks (or other commodities, like valuable materials, forex and others), the fund themselves are traded as if they were regular stocks, so their prices are subject to the same market pressures. I'm sure not many traders go check each underlying commodity's value, multiply it by its percentage held into the fund and estimate its overall value before setting a price to either buy or sell it, so my question is : what forces or processes keep the trading value of such investment products within a certain range of the cumulative sum of what they are composed of, instead of having its own value on the markets? Or is my premise even right to begin with?",
        "created": "2024-02-29",
        "num_comments": 7,
        "ups": 5,
        "downs": 0,
        "score": 5,
        "permalink": "https://www.reddit.com/r/investing/comments/1b3e2jt/how_do_equity_titles_like_funds_and_etf_values/"
    },
    {
        "id": "1b38vqw",
        "subreddit": "investing",
        "upload_date": "2024-02-29",
        "title": "Recurring buys strategies",
        "selftext": "I want to set up recurring buys on certain stocks to avoid trying to time the market and second guessing my choices. Haven’t done too hot with individual stocks so was thinking of setting it to buy VOO and SCHD biweekly.\n\nHaven’t seen much on recurring investments so was wondering how this sounds, and if anyone has any other strategies",
        "created": "2024-02-29",
        "num_comments": 2,
        "ups": 2,
        "downs": 0,
        "score": 2,
        "permalink": "https://www.reddit.com/r/investing/comments/1b38vqw/recurring_buys_strategies/"
    }
]