[
    {
        "id": "1bo4z88",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "McDonald's to sell Krispy Kreme doughnuts nationwide by the end of 2026",
        "selftext": "McDonald’s is planning to sell Krispy Kreme doughnuts at its restaurants nationwide by the end of 2026, the chains announced Tuesday.\n\nThe rollout will start in the second half of this year, but it will take roughly two and a half years as Krispy Kreme more than doubles its distribution to satisfy the partnership. For the duration of the agreement, McDonald’s will be the exclusive fast-food partner for Krispy Kreme in the U.S.\n\nThe doughnut chain uses a “hub and spoke” model that lets it make and distribute its treats efficiently. Production hubs, which are either stores or doughnut factories, send off freshly made doughnuts every day to retail locations such as grocery stores and gas stations.\n\nThe partnership with McDonald’s is a major opportunity for Krispy Kreme to expand its reach. It delivers its doughnuts to 6,800 third-party stores, as of Dec. 31. McDonald’s has roughly 13,500 restaurants in the U.S. and plans to open 900 new locations nationwide by 2027.\n\n“We think we can service about 6,000 restaurants with our existing infrastructure, mostly doughnut shops, which have excess capacity,” Krispy Kreme CEO Josh Charlesworth told CNBC.\n\nKrispy Kreme has also been expanding its capacity so it can deliver fresh doughnuts to the roughly 7,500 McDonald’s restaurants that it can’t currently reach.\n\nWhile McDonald’s is the primary reason the company is expanding its distribution so quickly, Charlesworth said Krispy Kreme will also be using the opportunity to land in grocery and convenience stores that prefer national suppliers.\n\n“That means that the overall efficiency and productivity of our distribution network will significantly improve over time, not just because of all those local deliveries,” he said.\n\nAdditionally, Krispy Kreme’s doughnut shops typically make more of the sweet treat than the chain can sell. The extra demand from McDonald’s and other new customers means its production lines can churn out higher volume with few additional costs.\n\n“Overall, therefore, it makes our system more profitable to grow the deliver fresh daily channel, and McDonald’s is an accelerator of that,” Charlesworth said.\n\nThe two chains’ relationship started about a year and a half ago, when McDonald’s began selling Krispy Kreme doughnuts at nine restaurants as a test. Months later, the pilot had expanded to roughly 160 restaurants across Louisville and Lexington, Kentucky. Those initial restaurants will keep selling the doughnuts during the national rollout.\n\nDemand from McDonald’s customers during the tests exceeded both chains’ expectations, according to Charlesworth.\n\nFor McDonald’s, the addition of Krispy Kreme doughnuts helps bolster its bakery and breakfast offerings. The burger chain has been leaning into coffee, a common drink pairing for doughnuts, but trimming other bakery items such as cinnamon rolls from its menu.\n\nMcDonald’s customers will be able to order the original glazed, chocolate iced with sprinkles and chocolate iced cream-filled doughnuts, either individually or in packs of six. The restaurants will sell the doughnuts all day.\n\nIn the long term, Krispy Kreme now expects it can reach more than 100,000 points of access for its doughnuts globally, up from its prior outlook of 75,000 locations. The chain’s doughnuts can currently be found in more than 14,100 stores across 39 countries.\n\nShares of Krispy Kreme have fallen 20% over the past year, dragging its market value down to $2.11 billion. As hype over weight loss drugs such as Novo Nordisk’s Ozempic has soared, investors have worried about whether the treatments will cut into Krispy Kreme’s future sales.\n\nSimilar concerns have weighed on McDonald’s, although its stock has risen 2% in the past year as consumers trade down to its cheap food and drinks. The company has a market value of $201 billion.\n\nSource: https://www.cnbc.com/2024/03/26/mcdonalds-to-sell-krispy-kreme-doughnuts-nationwide-by-end-of-2026.html",
        "summarized_selftext": " McDonald’s is planning to sell Krispy Kreme doughnuts at its restaurants nationwide by the end of 2026 . The rollout will start in the second half of this year, but it will take roughly two and a half years to satisfy the partnership . The partnership is a major opportunity for the doughnut chain to expand its reach .  Shares of Krispy Kreme have fallen 20% over the past year, dragging its market value down to $2.11 billion . The doughnut chain’s doughnuts can currently be found in more than 14,100 stores across 39 countries .",
        "summarized_comments": " You would just need a heated tray for storage and a warming lamp to keep the donuts \"hot\" in the cases at the actual Krispy Kreme locations .  The poor in certain communities have low access to vegetables and healthier food options but rest assured they will still have access to McDonalds &amp; Donuts . California is definitely getting the rollout first .  A donut-bun Quarter Pounder would end entire bloodlines . McDonald's will shrink in size, taste like shit, and be overpriced .  This is a direct response to California passing their new minimum wage law, with an exemption for any restaurant that sells bread or sells bread . It's just a ploy by Krispy Kreme to make it in the Houston market .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9959702491760254,
        "created": "2024-03-26",
        "num_comments": 136,
        "ups": 983,
        "downs": 0,
        "score": 983,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo4z88/mcdonalds_to_sell_krispy_kreme_doughnuts/"
    },
    {
        "id": "1bnkezx",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Reddit options launch draws bulls as shares extend gains",
        "selftext": "  \nNEW YORK (Reuters) - Options on Reddit drew a flurry of bullish bets on Monday as the social media platform's stock rallied as much as 16% after last week's strong market debut.  \nReddit shares soared 48% on the New York Stock Exchange as the company went public on Thursday, despite posting no annual profit since its launch in 2005.  \nOn Monday, Reddit was among the top gainers on the New York Stock Exchange, with the stock last up 15% at $53.01 in early afternoon trading.  \nSome 39,000 options traded by 1:10 p.m. (1710 GMT), with volume on pace to hit 62,000 contracts by the end of the day, Trade Alert data showed.  \nThe 2012 listing of options on Facebook Inc, now known as Meta Platforms, holds the record for the most active options market debut with some 360,000 contracts changing hands on the first day of trading.  \nReddit options buyers leaned toward bullish bets, analysts said.  \n\"The action is on the call side and collected around the upside,\" said Ophir Gottlieb, chief executive of Los Angeles-based Capital Market Laboratories. \"With the stock trading higher on Day One, this feels like speculation for higher moves.\"  \nApril call options with strike prices of $50 to $75 were among the most actively traded Reddit contracts. Among puts, contracts guarding against a drop below $25 by mid-April were the most traded.  \nCalls convey the right to buy shares at a fixed price in the future, while puts offer the right to sell them at a set price.  \n\"Reddit trading is reminding me of meme stocks,\" said Matt Amberson, founder of options analytics service ORATS, referring to stocks with viral popularity among individual investors who often use options to express their views.  \n\"Retail is in control and buying calls to the moon,\" Amberson said.  \nMeme stocks emerged in 2020, led by GameStop whose price rose as much as 100 times over several months in 2021, largely on the sentiment of individual buyers connected through the Reddit community forum WallStreetBets.  \nCommenters on Reddit's largest stock trading forums voiced skepticism about the long-term outlook for the money-losing company's shares.  \n\"Considering that Reddit can serve as a forum for individual investor speculation, it's no surprise that we see heavy buying of upside, near-term calls,\" said Steve Sosnick, chief strategist at Interactive Brokers.  \n\"The fact that we're seeing so much activity in far out-of-the-money options – in both directions – tells me that speculators are driving the trading today,\" he said.  \n(Reporting by Saqib Iqbal Ahmed; Editing by Megan Davies and Richard Chang)\n\n  \nSource: https://finance.yahoo.com/news/reddit-options-launch-draws-bulls-174113771.html  \n",
        "summarized_selftext": " Options on Reddit drew a flurry of bullish bets on Monday as the social media platform's stock rallied as much as 16% after last week's strong market debut . Some 39,000 options traded by 1:10 p.m. (1710 GMT) Volume on pace to hit 62,000 contracts by the end of the day . April call options with strike prices of $50 to $75 were among the most actively traded Reddit contracts .",
        "summarized_comments": "Summarization not available for this chunk.  27.6k call volume, 25.4k put volume on Reddit IPO volume . The stock closed at @$59.75 after hours (7:17pm EST)  Reddit's market cap is far below SNAP or Pinterest, but there's value here to be unlocked . Reddit execx and employees can't sell until after release of financials in Q3 (so mid July I think)  It's just as likely to drop like a rock as it is to go up. It's not even a Meme stock (yet)... It's barely getting started. The problem with your logic is thinking any \"tech\" company that releases with a less than 10 billion market value is underpriced .  Market has not made sense  for many years, IPOs are  just a cash cows for CEO &amp; friends . It's far outpaced GDP growth, even accounting for inflation . People are just buying en masse, hoping it's the next Nvidia. They picked a good time for the ipo. The market today proves that. It will be an expensive lesson.  This does have the feel of GME rebooted, but I have no idea if it will go that way . The focal center of meme culture just became self aware on the NYSE . Reddit doesn't give me any kind of clear value signal .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9992985725402832,
        "created": "2024-03-25",
        "num_comments": 98,
        "ups": 234,
        "downs": 0,
        "score": 234,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bnkezx/reddit_options_launch_draws_bulls_as_shares/"
    },
    {
        "id": "1bnmvzo",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Barclay upgrades Disney expecting streamer profitability sooner than guided &amp; to achieve 25-30% margins. DIS is up 3% today; up 30% YTD",
        "selftext": " Barclays analyst Kannan Venkateshwar upgraded the stock to Overweight from Equal Weight and boosted his price target on shares to **$135 from the prior $95**. The move implies roughly 15% upside based on current trading levels of about **$120** a share.\n\nVenkateshwar argued better-than-expected free cash flow and earnings guidance, coupled with \"tactical tailwinds\" such as the Hollywood strikes, Hulu's consolidation, and cost cuts, have helped buoy investor confidence. \n\nMeanwhile, \"*the propensity among media investors to be long Disney, has resulted in the stock outperforming broader markets meaningfully thus far this year, at a pace faster than we anticipated*.\"\n\nThe stock has been on a tear since the start of the year, up more than **30%** compared to the S&amp;P 500's 10% rise over that same time period.\n\nIt's a significant turnaround for the company after its stock price hit multiyear lows last year. The media giant has been grappling with challenges that include a declining linear TV business, slower growth in its parks business, and losses in its streaming business. A heated proxy battle with activist investor Nelson Peltz has also clouded the company's outlook.\n\nBut Venkateshwar argued Disney's next phase \"*may be more impactful as a number of turnaround elements still remain work in progress and may manifest more in numbers starting next year*.\"\n\nIn his bull case, the analyst said **sooner-than-expected streaming profitability** could serve as a boon to the stock price.\n\n*\"We expect Disney streaming to break even potentially a quarter or two earlier than company guidance of Q4 2024*,\" he explained. \"*This is in part driven by the tailwinds from cost cuts over the last few quarters and recent price increases*.\"\n\nVenkateshwar said he believes Disney will likely achieve streaming margins \"*that are better than Netflix*,\" estimating potential margins in the **25% to 30% range**, \"*which is not too different from where linear margins today are*.\"\n\nOther \"*upside narrative surprises*\" could include **ESPN's** yet-to-be-announced streaming partners for its over-the-top service, set to debut sometime in fall 2025, in addition to a refocused attention on long-term **succession** plans post-proxy battle.\n\nConversely, the analyst's bear case calls out declining non-sports TV viewership as linear network revenue falls amid increased cord cutting. Streaming, although a potential positive, could also be a net negative if subscriber growth does not pick up and pricing headwinds hit revenue growth.\n\n*Source:* [*https://finance.yahoo.com/news/disney-stock-upgraded-by-barclays-as-turnaround-plan-takes-shape-155209507.html*](https://finance.yahoo.com/news/disney-stock-upgraded-by-barclays-as-turnaround-plan-takes-shape-155209507.html)",
        "summarized_selftext": " Barclays analyst Kannan Venkateshwar upgraded Disney's stock to Overweight from Equal Weight and boosted his price target on shares to $135 . The move implies roughly 15% upside based on current trading levels of about **$120** a share . The stock has been on a tear since the start of the year, up more than 30% compared to the S&amp;P 500's 10% rise .",
        "summarized_comments": " Disney is a good buy but not bc of espn. They haven't been able to adjust to online quickly enough, cable cutters galore . The theme parks and cruises are the gem. Shoring up biz for streaming was key. Then selling off linear assets would be next step .  Disney was at bargain value early this year, but it’s not selling at a bargain price . By most ratios it is far more expensive compared to other entertainment sector stock. This is a turnaround play. The market doesn't care about the quality of the product as long as it sells it .  Disney stock is still more than 1/3rd below its ATH, and even 20% below their prepandemic high . The box office bombs i see as temporary and streaming is a great long term play for them .  Couldn’t be happier with disney stock and never going back . Definitely an undervalued company and hopefully their headwinds shake up into nothing .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9955412745475769,
        "created": "2024-03-25",
        "num_comments": 48,
        "ups": 212,
        "downs": 0,
        "score": 212,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bnmvzo/barclay_upgrades_disney_expecting_streamer/"
    },
    {
        "id": "1bo59tq",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Uber's Strange Acquisition Of Postmate's",
        "selftext": "Uber acquired Postmate's in 2020 for around 2.65 billion, since then, the Postmates and Uber Eats apps have been ran separately, they are basically the exact same app except one has Postmate's branding and one has Uber Eats branding. This is very odd marketing to me. Why not get rid of Postmate's as a brand altogether? Isn't it costly to keep both these apps running? Was this acquisition simply done to get rid of competition and to poach their customers ? ",
        "summarized_selftext": " Uber acquired Postmate's in 2020 for around 2.65 billion, since then, the Postmates and Uber Eats apps have been ran separately . This is very odd marketing to me. Why not get rid of Postmates as a brand altogether? Isn't it costly to keep both these apps running?",
        "summarized_comments": " Google Maps and Waze actually have functional differences . When consumers have more choices it’s basically a pricing war to the bottom . Less competition means they have more pricing power too .  The Postmates brand is connected to a different set of clientele and partners . If they rename or combine it with something else they risk having to write off that trade name value .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.977009117603302,
        "created": "2024-03-26",
        "num_comments": 27,
        "ups": 73,
        "downs": 0,
        "score": 73,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo59tq/ubers_strange_acquisition_of_postmates/"
    },
    {
        "id": "1bnjw8g",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "I'm paper trading to learn. Why is this bigger call paying more? ",
        "selftext": "I'm trying to learn everything about trades and options. Reading as many books as I can. \n\nAnyways I added an NVIDIA call at 945 on 3/22 and for some reason the profit it shows is only 400.\n\n\nYet the 950 call I did yesterday is profiting 500?\n\nCan someone explain why and how that works? \n\nWouldn't 945 give me more money since anything north of that price is more profit than anything north of 950?\n\n\n\nAlso the 945 NVIDIA call says the BREAKEVEN price is 967, how am I profiting if Nvidia is below that right now?\n\n\nhttps://imgur.com/a/hUd6swx\n",
        "summarized_selftext": " I'm trying to learn everything about trades and options . I added an NVIDIA call at 945 on 3/22 and for some reason the profit it shows is only 400 . Yet the 950 call I did yesterday is profiting 500?",
        "summarized_comments": " You're profiting even though NVDA is below breakeven because of the time value of an option . If a call strike is above current share price then there is no intrinsic value . No one would exercise those calls and buy NVDA for that strike when they could buy it at market price .  The price of the option contract has moved as the stock moved, options pricing is based on the greeks, which change as the price changes hence why you are in profit even though the call is OTM presently .  In rough terms Delta is how much the option will increase in price as it goes closer to or further in the money . Theta is how fast the option's Delta will decay over time . To get big call movements, you would want to get far OTM calls .  Call options with strike prices that are closer to the current market price of NVIDIA stock (950 calls) generally have higher intrinsic value than call options that are farther away from the current price (945 calls) 950 call options may show higher profits even if the price of the stock fluctuates similarly . The value of an option declines over time, especially as the expiration date approaches .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.990203857421875,
        "created": "2024-03-25",
        "num_comments": 32,
        "ups": 44,
        "downs": 0,
        "score": 44,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bnjw8g/im_paper_trading_to_learn_why_is_this_bigger_call/"
    },
    {
        "id": "1bo5xkp",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Amazon launches same-day prescription delivery in New York and Los Angeles",
        "selftext": "Amazon’s effort to get customers in the two largest U.S. markets whatever they want on the day of their order has expanded to include prescription drugs.\n\nThe e-commerce giant said on Tuesday that it’s rolling out same-day delivery of prescription medications in New York City and the greater Los Angeles area.\n\nThe prescriptions are offered via Amazon’s online pharmacy service, which launched in 2020. Amazon Pharmacy, born out of the company’s 2018 acquisition of online pharmacy PillPack, allows customers to order prescription medications for home delivery, with free shipping for Prime members.\n\nTo speed up deliveries, Amazon said it’s using new, smaller facilities, stocked with the most common prescription medications for acute conditions. The locations are equipped to process a prescription “within a matter of minutes rather than hours or days,” the company said.\n\n“By bringing Amazon Pharmacy’s deliveries into our existing world-class logistics network, Amazon is building the fastest and most convenient service for the home delivery of prescription medications,” Doug Herrington, CEO of Worldwide Amazon Stores, said in a statement. “These faster delivery speeds will be a game changer when you or your family need your medications quickly.”\n\nSan Bernardino, Riverside and Anaheim, which are all in the LA area, are eligible for same-day prescription deliveries starting Tuesday. The broader LA metro area will be up and running in April. The company plans to add more than a dozen other cities by the end of the year.\n\nIn October, Amazon began offering same-day prescription medication delivery in Seattle, Miami, Indianapolis, Phoenix and Austin, Texas. At the same time, the company said it would start sending prescription medications via drone in College Station, Texas, one of the two cities where Amazon is dispatching unmanned aircrafts to deliver items weighing five pounds or less.\n\nThe company said it’s dispatching e-bikes to handle some Amazon Pharmacy deliveries in New York. Amazon has been experimenting with e-cargo delivery bikes, which can speed up deliveries and cut down on emissions, in the city for the past several years.\n\nSource: https://www.cnbc.com/2024/03/26/amazon-launches-same-day-prescription-delivery-in-new-york-la.html",
        "summarized_selftext": " Amazon is rolling out same-day delivery of prescription medications in New York City and Los Angeles . Amazon Pharmacy allows customers to order prescription medications for home delivery, with free shipping for Prime members . The company plans to add more than a dozen other cities by the end of the year .",
        "summarized_comments": " CVS still hasn’t filled my prescription from January 7. It’s fucking dangerous to get taken off your meds for that long. I’m dysfunctional from the discontinuation syndrome and suicidal from being without meds and (getting fired from my job, because I need medication).",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9994944334030151,
        "created": "2024-03-26",
        "num_comments": 4,
        "ups": 39,
        "downs": 0,
        "score": 39,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo5xkp/amazon_launches_sameday_prescription_delivery_in/"
    },
    {
        "id": "1bo8n5a",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Tesla (TSLA.O), will offer U.S. customers a month's free trial of Full Self-Driving (FSD), CEO Elon Musk said on Monday",
        "selftext": "\"All U.S. cars that are capable of FSD will be enabled for a one-month trial this week,\" Musk said in a post on social media platform X.\n\nHe has also told Tesla staff to give demonstrations of FSD to new buyers and owners of serviced vehicles, according to two emails verified by a source who sought anonymity.\n\n\"Almost no one actually realizes how well (supervised) FSD actually works,\" Musk said in one of the two emails, sent to Tesla employees.\n\nSource: https://www.reuters.com/business/autos-transportation/tesla-give-one-month-driver-assist-technology-trial-customers-2024-03-26/\n",
        "summarized_selftext": " \"Almost no one actually realizes how well (supervised) FSD actually works,\" Musk said in one of the two emails, sent to Tesla employees . Musk has also told Tesla staff to give demonstrations of FSD to new buyers and owners of serviced vehicles .",
        "summarized_comments": " FSD package sales are slumping. From 53% in 2019 to 14% in 2024 of new car purchases. That doesn't account for people who purchase it later or go for the monthly $200 a month option . A free trial for all capable cars will also pull in a lot of new data to train the system .  Tesla's V12.3 beta version of its autopilot system is being offered free for $200 a month . The system will turn itself off milliseconds before a crash to avoid being held liable . Tesla wants to have their cake and eat it too. Advertise/brand it as being fully autonomous .  The only thing worse than a human driver is an autonomous driver that requires constant human supervision . \"Supervised FSD\" is the Oxymoron of the Year ![gif](emote|free_emotes_pack|joy)  Getting a Tesla is now like the prize you get after one of those dumb agonizing Time Share presentations they force you to get through before you get a “prize” It isn't full self-driving and Tesla should be required to change the name at this point .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9994109869003296,
        "created": "2024-03-26",
        "num_comments": 59,
        "ups": 71,
        "downs": 0,
        "score": 71,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo8n5a/tesla_tslao_will_offer_us_customers_a_months_free/"
    },
    {
        "id": "1bng02f",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Counter to proxy recommendations &amp; prior public statements, Peltz withholds votes from Disney CEO Bob Iger",
        "selftext": "Nelson Peltz’s Trian Fund Management withheld its votes from Walt Disney\r CEO Bob Iger when voting its shares in the bitter proxy battle the asset management firm is waging against the entertainment giant, according to sources who monitor the situation.\r  \n\r  \nThe move is hardly shocking, given the acrimonious nature of the battle.\r However, it is counter to Trian’s proxy recommendations, and it doesn’t mesh with the public statements Peltz has made about wanting to work together with management if he is elected to the Disney board.\r  \n\r  \nIn recent weeks, Disney has stepped up its attacks on Trian and Peltz. “Correcting Trian’s Fact With Fiction” was the headline of a recent investor presentation from Disney, over a picture of Pinocchio with a growing nose.\r “*Disney is stupid because I’m not trying to fire Bob Iger, I want to help him*” Peltz recently told the Financial Times. “*We don’t fire CEOs*.”\r  \n\r  \nWhen asked for comment, a Trian spokesperson directed CNBC to a press release repeating its proxy recommendations and stating that Trian supports Iger as a candidate for the board and as CEO.\r Withholding its votes from Iger, however, is hardly a supportive move of his leadership, and it raises questions about how toxic of an environment the boardroom would be if Peltz is elected to the Disney board next month.\r  \n\r  \nDisney has nominated a slate of 12 directors, including Iger. Trian is officially recommending shareholders vote for Peltz and former Disney Chief Financial Officer Jay Rasulo and to withhold votes for Disney nominees Maria Elena Lagomasino and Michael Froman, who are current board members.\r  \n\r  \nTrian owns a relatively small position in Disney, representing about **1.5%** of the outstanding shares when combined with the ownership position of former Marvel Entertainment Chairman and CEO Ike Perlmutter, who has sided with Peltz in the proxy battle.\r  \n\r  \nThe Disney board meeting will be held April 3, and Trian could change its vote between now and then.\n\n***Source***: *https://www.cnbc.com/2024/03/25/nelson-peltz-withholds-votes-from-disney-ceo-bob-iger-in-proxy-battle.html*",
        "summarized_selftext": " Nelson Peltz’s Trian Fund Management withheld its votes from Walt Disney CEO Bob Iger in the bitter proxy battle . The move is hardly shocking, given the acrimonious nature of the battle . Trian owns a relatively small position in Disney, representing about **1.5%** of the outstanding shares .",
        "summarized_comments": " Welcome to r/stocks! For stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.] For beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.]",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9970782995223999,
        "created": "2024-03-25",
        "num_comments": 3,
        "ups": 17,
        "downs": 0,
        "score": 17,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bng02f/counter_to_proxy_recommendations_prior_public/"
    },
    {
        "id": "1bo3n8k",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "r/Stocks Daily Discussion &amp; Technicals Tuesday - Mar 26, 2024",
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help **measure the trajectory of a security.**  TA can also be used to interpret the actions of other market participants and predict their actions.\n        \nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "summarized_selftext": " Technical analysis (TA) uses historical price movements, real time data, indicators based on math and statistics, and charts to measure the trajectory of a security . TA can be useful on any timeframe, both short and long term .",
        "summarized_comments": " Goldman Sachs initiated coverage of ATS Corporation with a Sell rating and $34 price target . Goldman Sachs believes the company's end markets in the near-medium term are at a \"cyclical pause\" Outside of life sciences, order trends have either been declining or muted across the rest of the portfolio .  Reddit is a wonderful resource for finding about great stocks and the stock market in general . Reddit can also be an echo chamber and extreme hive mind . PayPal (PYPL) will hit $75 this summer and likely $100 by eoy. Fisker (FSR) delisting. FSLA's valuation, Elon even less, but glad I bought in at 170 for swing trade .  Port of Baltimore loaded 2.4mn t of coal in February, up from 2.1mn t a year earlier . Two of the US Atlantic coast's five coal terminals are in Baltimore . Two terminals take thermal and coking coal from Northern and Central Appalachia .  The duration of the closure is a big variable . Does this affect any shipping routes to coal fired plants in the continental USA and if so does that mean alternative sources will be used to the grid in the short or long term .  5 years is my usual analysis period, with the hope/plan to ultimately hold longer . Projecting out beyond 5 years introduces a ton of uncertainty . However, shareholder returns approximate earnings yield in the short run but are proportional to return on invested capital in the long run .  The Baltimore Bridge Collapse is likely an overreaction then the blip will be gone by Thursday . Baltimore is a large car importer and coal exporter . Car will shift to the other ports and I expect coal to move to Great Lakes .  Many bears are calling for it's death that make me recall why I invested in FB (now META) at $19/share and still holding . The price will adjust after the founder start selling some shares and then I will look at eyeball retention .",
        "comment_sentiment": "POSITIVE",
        "comment_sentiment_confidence": 0.9960035681724548,
        "created": "2024-03-26",
        "num_comments": 66,
        "ups": 1,
        "downs": 0,
        "score": 1,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo3n8k/rstocks_daily_discussion_technicals_tuesday_mar/"
    },
    {
        "id": "1bo95aw",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "These are the stocks on my watchlist (3/26)",
        "selftext": "This is a watchlist. I might trade all of the stocks on here, or none of them, on any given day. I might trade stocks that don't appear on here! I hold no positions in any stocks long-term but Amazon/Mag7/general broad market indices. (unless otherwise noted in these tickers).\r  \n\r  \nI usually make these watchlists premarket, (or from 6:30 to 7 as time permits), but can be delayed if I'm trading the open. These aren't mean to be taken as gospel or any recommendation to buy/sell. Many stocks I post are &lt;$500M market cap. Most are NOT good long-term investments but are good candidates to day trade.\r  \n\r  \n**News: Hazmat Traffic Faces Big Detour After Baltimore Bridge Collapse**\r  \n\r  \n**ALAB-** Stock is still on a tear, after breaking the $80 level I was interested in yesterday. $95/$100 levels worth watching now.\r  \n\r\r\r  \n**RDDT-** Topped out at $75 today. Looks like RDDT and the stock I mentioned above are moving in conjunction with each other.\r  \n\r  \n**VKTX-** News that promising weigh loss pill (not a shot!) has promising data. Up 26%.\r  \n\r  \n**TSLA-** Rumor that Italy contracting Tesla to have truck production take place there.\r  \n\r  \n**DNUT**\\- MCD to sell Krispy Kreme’s Donuts by end of 2026.\r  \n\r  \n**Longer-term watches:** NVDA/SMCI, SNOW, BA, LULU",
        "summarized_selftext": " This is a watchlist. I might trade all of the stocks on here, or none of them on any given day . These aren't mean to be taken as gospel or any recommendation to buy/sell . Many stocks I post are &lt;$500M market cap. Most are NOT good long-term investments but are good candidates to day trade .",
        "summarized_comments": " Goldman Sachs initiated coverage of ATS Corporation with a Sell rating and $34 price target . Goldman Sachs believes the company's end markets in the near-medium term are at a \"cyclical pause\" Outside of life sciences, order trends have either been declining or muted across the rest of the portfolio .  Reddit is a wonderful resource for finding about great stocks and the stock market in general . Reddit can also be an echo chamber and extreme hive mind . PayPal (PYPL) will hit $75 this summer and likely $100 by eoy. Fisker (FSR) delisting. FSLA's valuation, Elon even less, but glad I bought in at 170 for swing trade .  Port of Baltimore loaded 2.4mn t of coal in February, up from 2.1mn t a year earlier . Two of the US Atlantic coast's five coal terminals are in Baltimore . Two terminals take thermal and coking coal from Northern and Central Appalachia .  The duration of the closure is a big variable . Does this affect any shipping routes to coal fired plants in the continental USA and if so does that mean alternative sources will be used to the grid in the short or long term .  5 years is my usual analysis period, with the hope/plan to ultimately hold longer . Projecting out beyond 5 years introduces a ton of uncertainty . However, shareholder returns approximate earnings yield in the short run but are proportional to return on invested capital in the long run .  The Baltimore Bridge Collapse is likely an overreaction then the blip will be gone by Thursday . Baltimore is a large car importer and coal exporter . Car will shift to the other ports and I expect coal to move to Great Lakes .  Many bears are calling for it's death that make me recall why I invested in FB (now META) at $19/share and still holding . The price will adjust after the founder start selling some shares and then I will look at eyeball retention .",
        "comment_sentiment": "Neutral",
        "comment_sentiment_confidence": 0,
        "created": "2024-03-26",
        "num_comments": 0,
        "ups": 6,
        "downs": 0,
        "score": 6,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo95aw/these_are_the_stocks_on_my_watchlist_326/"
    },
    {
        "id": "1bo9d7j",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "How to best take advantage of pharma stock gains",
        "selftext": "I'm not much one for picking individual stocks. Primarily because I'm new to evaluating them. Have felt a lot more comfortable with ETFs. I feel pretty bullish though about a lot of recent pharma developments, as I'm sure many of you do, with Eli Lilly, Novo, etc, even Viking Therapeutics today. But I'm surprised to see how underwhelming the biggest pharmaceutical ETFs do. \n\nPPH (VanEck) is up about 17% over past year\nPJP (Invesco) is up about 6%\nIHE (iShares) is up about 15%\nXPH (SPDR) is up about 3%\n\nI know some stocks like Johnson and Johnson or AstroZeneca are weighing them down over past year, but I'm surprised they're still not doing better. How would you most take advantage of the current upside? Just picking specific stocks?\n\nAppreciate your thoughts",
        "summarized_selftext": " I'm surprised to see how underwhelming the biggest pharmaceutical ETFs do . I'm not much one for picking individual stocks. Have felt a lot more comfortable with ETFs. I feel pretty bullish though about a lot of recent pharma developments .",
        "summarized_comments": " Whoops, that list of ETF performances was supposed to be spaced out nicely . Sorry it's not so legible. Sorry it was meant to be .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9995303153991699,
        "created": "2024-03-26",
        "num_comments": 1,
        "ups": 5,
        "downs": 0,
        "score": 5,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo9d7j/how_to_best_take_advantage_of_pharma_stock_gains/"
    },
    {
        "id": "1bo8qey",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "How do new publicly traded companies have years of history already?",
        "selftext": "I realize this is a novice question, but I'm curious about the context I'm missing. According to NASDAQ, Trump Media &amp; Technology Group Corp. Common Stock (DJT) shows a starting point of what appears to be 10/01/2021, with years of active trading, but according to the news today is the first day of trading.\n\nSo what's going on here?\n\nhttps://www.nasdaq.com/market-activity/stocks/djt",
        "summarized_selftext": " According to NASDAQ, Trump Media &amp; Technology Group Corp. Common Stock (DJT) shows a starting point of what appears to be 10/01/2021, with years of active trading, but according to the news today is the first day of trading .",
        "summarized_comments": " DJT was created through a merger with a company that has been public since 2021 . It’s a way around SEC regulations regarding IPOs . They take over a holding company who already has a ticker on the exchange and change the name .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.983332633972168,
        "created": "2024-03-26",
        "num_comments": 5,
        "ups": 1,
        "downs": 0,
        "score": 1,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo8qey/how_do_new_publicly_traded_companies_have_years/"
    },
    {
        "id": "1bo7spx",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Will TSLA be around in 18 years?",
        "selftext": "I'm having a baby! (technically my wife is :) ). I have all the new human accounts set up, ETFs picked out, etc. (I'm team VOO).\n\nI have a few extra dollars from my bonus this year, and thought it would be cool to buy a few stocks outright on her birthday so she can see what happens to them over her lifetime. \n\nBut what to pick?\n\nI have already chosen AAPL, MSFT, DIS, AMZN\n\nI was thinking of adding TSLA or NVDA because of the \"trendiness\" right now. Sort of a history lesson more than an investment. Will they be around when the baby becomes an adult?\n\nAny other ideas? I'm a bit tech heavy in my list above.\n\nCheers!\n\n",
        "summarized_selftext": " I'm having a baby! (technically my wife is :) ) I have all the new human accounts set up, ETFs picked out, etc. (I'm team VOO) I have a few extra dollars from my bonus this year, and thought it would be cool to buy a few stocks outright on her birthday .",
        "summarized_comments": " Tesla arguably has some of the best tech in a car period, period. They are actually profitable at producing and selling cars. They have the best charging network in the USA. They could lose government subsidies, China could ban them and the whole operation goes bankrupt in a few years. There is no definitely in this world.  In 18 years self driving cars will be old skool tech because why have only the car able to drive when you can have a personal robot that can drive any car? Tesla has a massive lead in both software and charging network . Tesla has grown their business in data collection, self driving, software, charging network, etc.  Tesla has bigger profit margins on their solar/solar battery systems than they do on the cars . Tesla already has 55,000 fast charging stations in the US; 85000 worldwide . Tesla will be licensing their self driving software and their new battery tech for a long time to come .  Question should be: what will be TSLA market capitalization in 18 years? Likely a fraction of what we see today. The smell test? Maybe you can be an intern for Jim Cramer. The last stainless steel car… and its founder…",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.8694502115249634,
        "created": "2024-03-26",
        "num_comments": 37,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo7spx/will_tsla_be_around_in_18_years/"
    },
    {
        "id": "1bo0kok",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Beyond Meat $BYND - The Forgotten Stock",
        "selftext": "\nLove or hate their products, Beyond Meat is undervalued and market sentiment is overly bearish.\n\n\nBusiness Overview\n\nBeyond Meat is a leading plant-based meat company offering a portfolio of revolutionary plant-based meats.\n\nCatalyst\n\n1 - The flagship product Beyond Burger is launching the fourth generation to the market in April &amp; May. This new version reduces saturated fat by 60% and sodium by 20%. It is also the first plant based meat company to meet the American Diabetes Association’s evidence-based nutritional guidelines.\n\n2 - The company has gone through restructuring and cost cutting over the past year and 2024 is when it will begin to materialize. They’ve forecasted moving from a negative gross margin to positive mid-high single digit gross margin by end of year.\n\n3 - The company recently announced 250mm shelf offering. Normally this would be negative news, however this eliminates the risk of bankruptcy and the market now knows how much capital maybe raised over the upcoming year(s).\n\n4 - Demand has been declining in United States. The company is shifting the narrative from meat replacement to the healthy benefits of the plant based alternative. This along with the ADA label may help re-spark consumer interest.\n\nIn Europe, sales have been rising and continue to be a strong market.\n\n5 - Generally, demand is greater during the U.S. summer grilling season. The compounding changes should be reflected in first half of the year.",
        "summarized_selftext": " The company has gone through restructuring and cost cutting over the past year and 2024 is when it will begin to materialize . The company is shifting the narrative from meat replacement to the healthy benefits of the plant based alternative .",
        "summarized_comments": " A pound of plant based plant based ground is 6.99, for some plants pumped with dippin dots oil balls . Most vegans and vegetarians I know are in a similar boat and I suspect most meat eaters will just eat meat .  \"Beyond Beyond is dead here, no one is buying their tasteless unhealthy lies,\" says one user . \"Every vegetarian I meet here in Europe likes it including my girlfriend,\" says another user .  In Europe fast food chains offer a vegan or vegetarian option as standard because younger consumers have changing diets . Beyond Meat has the same issue like Oatly and most other plant based/vegan companies . Their products are easily replaceable with other brands or (cheaper) private label products .  Beyond jerky has no cholesterol and doesn't come from an animal pumped with antibiotics but it's super easy to make a homemade vegan burger and I never eat burgers anyways . The few vegans I know don't want a meat substitute, they just want meat period . The beyond jerky is cheaper than regular jerky and tastes amazing, i buy that for long hikes or bike rides sometimes .  These are the \"ingredients\" of a peach: AQUA (88.9%), SUGARS (8.4%) (SUCROSE (48%), GLUCOSE, FRUCTOSE, MALTOSE, GALACTOSE (&lt;1%), FIBRE E460 (1.5%), FATTY ACIDS (69%))",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9951013922691345,
        "created": "2024-03-26",
        "num_comments": 55,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bo0kok/beyond_meat_bynd_the_forgotten_stock/"
    },
    {
        "id": "1bnlbo2",
        "subreddit": "stocks",
        "upload_date": "2024-03-26",
        "title": "Am I the only one that thinks Apple shot themselves in the foot with their stand on data privacy?",
        "selftext": "In the 2010s privacy and data collection was a big buzz word and there was this big awareness campaign against it. Apple decided to make a stand on it, and gamble that the consumer would value its high data protection policies more than MSFT and Google etc. \n\n10 years later, AI is clearly the new trend and obvious next evolution of growth. Did Apples policy decisions back then on data collection screw them?\n\nI see MSFT, GOOGL, AMZN having lots of data to train on but Apple has really been behind on any sort of AI development at all. ",
        "summarized_selftext": " In the 2010s privacy and data collection was a big buzz word and there was this big awareness campaign against it . Apple decided to make a stand on it, and gamble that the consumer would value its high data protection policies more than MSFT and Google . 10 years later, AI is clearly the new trend and obvious next evolution of growth .",
        "summarized_comments": " Apple sells iPhones in mass bulk to every phone carrier and almost every Fortune 500 company . Apple enjoys some of the most fevered user-base around . Google is inherent anti consumer as they make their profits on data capture .  The FBI wanted Apple to install a backdoor in all future iOS versions, which Apple refused to do . The FBI cracked it even without Apples help .  Apple tricked many of its users (like OP) into believing that their closed, anti-consumer ecosystem is better for you . It's one of my biggest positions with an iPhone, but from an investor perspective, its harder to make money off you . I think Apple will take a similar approach to Gen AI .  Apple already has 61% market share in the US . The big international markets like India and China are more or less impenetrable for Apple . But people will die apple users over switching to anything else, its a cult following basically .  Apple is an aggressive, sinister, and cutthroat company in the way it treats both consumers and developers, but at the end of the day, you can't say it hasn't been good for their bottom line . As long as Apple holds a majority stake in the most important hardware market, developers will still write for it .  Apple is probably a hold, especially if you are going to take the tax hit by selling, but it's probably trading sideways for the next year . The only major advantage they have is consistency in devices compared to Android .  The real answer is that we have no idea how much data Apple has on its users . Apple can protect its universe of user data and buy what it wants with its very deep pockets / cash / cash .  Apple will find a way to do AI without needing users to surrender their data like everyone else . The flipside is their greatest asset with Chinese consumers who are under social credit scrutiny and the USA who are afraid of China getting their info .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9931259155273438,
        "created": "2024-03-25",
        "num_comments": 93,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/stocks/comments/1bnlbo2/am_i_the_only_one_that_thinks_apple_shot/"
    },
    {
        "id": "1bnk5u7",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "60k &gt; 600k Massive MU 10 bagger to put me at 2 commas.",
        "selftext": "Had a stupid year.  Was basically broke at the start of 2023, then AMD started to take off.  Somehow I hit 2 early 10 baggers on AMD (exercised 10 of the calls) and ADBE last spring.  And managed to buy 500 shares of META with the proceeds.  Put me at about 240k to start the year this year.\n\nTo start the year I bought 60 450 strike META March calls that I rode through earnings which really gave me a fuckload of cash.  Put most of that into the Micron positions above.  Cashed out of those today.  I'll provide proof of any trade anyone requests.\n\nhttps://preview.redd.it/ft04zjmoriqc1.png?width=1127&amp;format=png&amp;auto=webp&amp;s=7d5371728d642a8b6bf7e4fb9020be40d2b22c55\n\nhttps://preview.redd.it/lovokmmoriqc1.png?width=1062&amp;format=png&amp;auto=webp&amp;s=0dcd055ac1c58896842cf90aadfe4a4dbff3507e\n\nhttps://preview.redd.it/8l0s3nmoriqc1.png?width=729&amp;format=png&amp;auto=webp&amp;s=10e15de4729f8f1b34cc9e02e77b923c2d24fc60\n\nhttps://preview.redd.it/v71lnnmoriqc1.png?width=727&amp;format=png&amp;auto=webp&amp;s=a135a23312d3afa25a288d3ff42dd7f8ae3c13d3",
        "summarized_selftext": " Had a stupid year. Was basically broke at the start of 2023, then AMD started to take off . Somehow I hit 2 early 10 baggers on AMD (exercised 10 of the calls) and ADBE last spring . Cashed out of those today .",
        "summarized_comments": " The WSB Discord is a weekly forum on Reddit . Please post your thoughts and videos of your work on Reddit and Twitter . Join the WSB discord on Twitter @WSBverse .  Pay off 50% of your home and then keep then try to grow out the money . Pay off the house, guaranteed +5% returns on that cash and you have insurance against your own potential self destruction .  \"Wall Street Betz\" is a Reddit forum where users bet on Bitcoin and other cryptocurrencies . The community is divided on whether or not to bet on the market .  The way capital gains taxes work in the US is a crime, but capital gains tax is a 'frivolous crime' Don't trade alt coins, only the top coins btc and eth, nothing else, you can go into low leverage positions and keep increasing your btc position every month .  Bitcoin traders have 75x leverage on bitcoin . They set their stop loss below the lowest Bitcoin was, below 16k and were willing to lose everything as the money I bet was out of a lawsuit I won (no live changing)  Micron's HBM (high bandwidth memory) used in Nvidia GPUs is sold out for the rest of 2024 &amp; part of 2025... So I guess we can expect similar earnings beats for the next 4 quarters (at least) The future could be bright for Micron, and the memory market is picking up .  The market has been insane this year, semiconductors have been insane, the fed has been printing money, and the market is behind it all . The recession was canceled and I got lucky at ground zero. I'm holding the same 100c for a bit longer .  \"I hope I won't regret it. I'm just thankful I didn't see MU plastered all over WSB\" \"I love that you went from 3y ago hardcore gamer to millionaire. Life is crazy\"",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.98945552110672,
        "created": "2024-03-25",
        "num_comments": 526,
        "ups": 2958,
        "downs": 0,
        "score": 2958,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnk5u7/60k_600k_massive_mu_10_bagger_to_put_me_at_2/"
    },
    {
        "id": "1bnt2w1",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Imagine not making money",
        "selftext": "scroll out you regard. \n\nposition MSTR last week 1 1500c and 1 1600c into 1000 SMCI sold early and missed out on 50k. Rebought 1600 MSTR friday and sold at the beginning today and missed out on 80k+. \n\nCurrent Position: Lulu 400c 3/28, Dwac 45c 3/28 (you owe me one trump for stealing my money in 2021) and 200c AMD 4/19. \n\nnot financial advice, just here for the casino.",
        "summarized_selftext": " MSTR last week 1 1500c and 1 1600c into 1000 SMCI sold early and missed out on 50k . Rebought 1600 MSTR friday and sold at the beginning today and missed 80k+. Current Position: Lulu 400c 3/28, Dwac 45c and 200c AMD 4/19 .",
        "summarized_comments": " This is the first post of all time . It's like watching a junkie going downhill. It was looking so good but then I kept scrolling through the photos. I went from “this mofo” to “oh ok, I'm good.” Summarization not available for this chunk.  The Gambler’s Tragedy in 4 slides is a perfect post . The post was about to congratulate you, but then I kept scrolling . I was so happy for you for two pics man. I don't have to imagine. I love you.  \"Imagine not making money\" is one of the most quintessential WSB posts ever . \"We are SO fucking Toppy. so I'd rather not imagine it,\" says OP .",
        "comment_sentiment": "POSITIVE",
        "comment_sentiment_confidence": 0.9962489008903503,
        "created": "2024-03-25",
        "num_comments": 296,
        "ups": 2715,
        "downs": 0,
        "score": 2715,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnt2w1/imagine_not_making_money/"
    },
    {
        "id": "1bnnew3",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Decent day, it's honestly meaningless until those earnings numbers come out",
        "selftext": "Been getting tons of deleted posts so I'm not even going to address the bears on here. Have fun guys",
        "summarized_selftext": " Been getting tons of deleted posts so I'm not even going to address the bears on here . Have fun guys. Have fun with the bears .",
        "summarized_comments": " WallStreetBets.com is a popular online gambling site . It's either lambo or wendys dumpster here . The no guidance and offering up nothing will cause the stock to plummet or trade flat .  The Reddit user is a self-made bot . He is a member of the Reddit community . He has made more on this before the earnings release than most people will ever see in their bank accounts... ever .  This might be the first time where the actual fundamentals of the company matter, says R/stocks.com analyst . Analyst: \"I think we are setup to surprise by quite a bit which usually leads to rapid reevaluating and big price movement\"  It seems genius to do it in a tax free account. Someone explain this shit to me. Is it calls or puts? I’ve never done options trading but the way life is going I definitely wanna learn so I'm all ears . I feel extremely confident that analyst expectations are going to be beat but a lot depends on what RC invested the cash into. I think the most likely scenario is that he bought Treasury bonds again which is enough to make us profitable . Summarization not available for this chunk.",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9993075132369995,
        "created": "2024-03-25",
        "num_comments": 267,
        "ups": 1710,
        "downs": 0,
        "score": 1710,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnnew3/decent_day_its_honestly_meaningless_until_those/"
    },
    {
        "id": "1bnixu1",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Billionaire Stan Druckenmiller reveals 21% of his portfolio is invested NVDA &amp; MSFT",
        "selftext": "Stan Druckenmiller ran a very successful hedge fund between 1981 and 2010. He never had a single losing year, and he returned an average of 30% annually to clients. Very few Wall Street money managers have a track record half that good, and that makes Druckenmiller an excellent case study for investors.\n\nToday, he manages his multibillion-dollar fortune through the Duquesne Family Office. As of the quarter ended in December, Druckenmiller had 21.1% of his portfolio invested in two \"Magnificent Seven\" stocks. **Nvidia** accounted for 9.1% and **Microsoft** accounted for 12% of his invested assets. The size of those positions is a clear sign of high conviction.\n\nsource: [https://finance.yahoo.com/news/billionaire-stan-druckenmiller-21-portfolio-093700483.html](https://finance.yahoo.com/news/billionaire-stan-druckenmiller-21-portfolio-093700483.html)",
        "summarized_selftext": " Stan Druckenmiller ran a very successful hedge fund between 1981 and 2010 . He never had a single losing year and returned an average of 30% annually to clients . Today, he manages his multibillion-dollar fortune through the Duquesne Family Office .",
        "summarized_comments": " The WSB Discord is a forum for the WSB News Network podcast . Join in the chat to discuss your investment in the market . Share your views in the comments below . Use the weekly Newsquiz to test your knowledge of the community .  The S&amp;P500 fund investor when rebalanced will have 7% Microsoft, 5% Nvidia, and 30+% in tech in general . Microsoft and NVIDIA are about 13% of the SP500......His portfolio would be like 12% NVDA and MSFT if he bought nothing but SPY, so this isn’t the ringing endorsement of those companies that OP thinks it is .  12% of his portfolio is Coupang, why is no one talking about it? \"Stan's a trader he'll put 10% in NVDA today see something, change his mind and short NVDA tomorrow\" \"Stan’s never lost before though and always wins by 30%+!\"",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9954606890678406,
        "created": "2024-03-25",
        "num_comments": 104,
        "ups": 1651,
        "downs": 0,
        "score": 1651,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnixu1/billionaire_stan_druckenmiller_reveals_21_of_his/"
    },
    {
        "id": "1bnn8nx",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "You guys are idiots for downplaying RDDT",
        "selftext": "do you realize GPT-1 through 3 were made primarily off Reddit posts?\n\nSam Altman is the largest shareholder in Reddit as well.\n\nPinterest is valued at 3.5x current Reddit valuation; yet Reddit has more traffic.\n\nThe fact that Reddit is valued so low and its ads make 10% of what meta makes off Facebook isn’t a weakness; it is a huge fucking opportunity. \n\nReddit is a social media AND AI play. You are idiots for going with the hive mind as you always do.\n\n",
        "summarized_selftext": " The fact that Reddit is valued so low and its ads make 10% of what meta makes off Facebook isn't a weakness; it is a huge fucking opportunity .Pinterest is valued at 3.5x current Reddit valuation; yet Reddit has more traffic than Pinterest .",
        "summarized_comments": " The WSB Discord is a forum for Reddit users to discuss Reddit . Join the forum for the weekly discussion of Redditors and users of the site .  If you bought at the up he’s up 15% now in the AH action, you’d say anyone they bought is winning it . ChatGPT is really bad about making stuff up in niche applications where some data exists but not a lot .  When the button is clicked, it will display a message box saying \"Hello, World!\" The script does the following: Imports necessary classes from the .NET Framework (`SystemWindows.Forms` for GUI components and `System.Drawing` for size and location properties) Defines a class `MyForm` that inherits from `Form,' representing the main window . Finally, it creates an instance of 'MyForm' and starts the application .  The moment they said it was going to tank, that was all the clue anyone needed to know . The only reason why there's any value to this site, is because real humans use it .  WSB seems to have confused \"wanting\" it to fail with \"absolutely going to fail\" It's still one of the highest trafficked sites on the internet, and now advertisers can have a piece .  Reddit is Gen Z’s third most visited social media after YouTube and Tik Tok is shit . Reddit is neither a particularly high percentage of all writing ever made, nor is it a source of particularly high quality writing . It's useful as a small part of the giant pile of all text ever written .  Reddit is trading below other social networking sites because it can’t monetize its users . That’s probably less than Google spends on filling the vending machines in their offices every year . Reddit doesn't make money off of AI scraping .  Reddit will be dead and you're left holding your bags by 2026 . This will kill most content on the platform . But the reality is the company doesn’t make any money . They have 800 million in revenue last year at 80% margin .  Reddit is one of the largest and longest living social media platforms alive currently and it is JUST going public . Theres no way it hovers around $40-50 for several years . Reddit also doesn't value it's own data so much .  RDDT's options chain just went live, and the abysmally low volume...this is clearly a meme type gamma ramp and it will continue until MMs have hedged and everyone starts shorting...every IPO same story .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9989349246025085,
        "created": "2024-03-25",
        "num_comments": 739,
        "ups": 1578,
        "downs": 0,
        "score": 1578,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnn8nx/you_guys_are_idiots_for_downplaying_rddt/"
    },
    {
        "id": "1bnpqop",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "I’m up 30% today on RDDT. Thanks Reddit!",
        "selftext": "",
        "summarized_selftext": "",
        "summarized_comments": " Reddit was the top percentage gainer on the New York Stock Exchange on Monday, finishing up 30% at $59.80 . Reddit market cap will be 158.9 billion which is pretty realistic in 2-3 years from selling our data .  RDDT was up 30% on Friday, but it looks like it won't tank soon . When I don't buy stocks go up, but when I do buy then stocks only go down . Whoever invents a Time Machine, they’re gonna be a trillionaire .  RDDT - buy buy buy... Meme to the moon . Reddit is the most under-recognized monopoly on the market . The fact that people not only use it, but are totally unaware of why they shouldn’t .  RDDT is nearly 2x the DSP price in AH trading trading . Bot bought 10 shares at $48 and sold at $61….shoulda bought calls at $59.80 just before close . Bot is a bot, and this action was performed automatically . Summarization not available for this chunk.  Most profitable stock I’ve bought. I bought them all the day they were trading in the regular stock market . I bought 29 @ 38.00, sold 7 @48, sold 10 @60. Holding the other 12 until we at the moon . I am a bot and this action was performed automatically .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9898743629455566,
        "created": "2024-03-25",
        "num_comments": 234,
        "ups": 1340,
        "downs": 0,
        "score": 1340,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnpqop/im_up_30_today_on_rddt_thanks_reddit/"
    },
    {
        "id": "1bnpmy0",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Citi loan Update: +$12k.",
        "selftext": "Tomorrow 🚀",
        "summarized_selftext": " CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery . Please submit your best shots of the day for next week's gallery of snapshots of your favorite destinations . Visit CNN iReport.com/Travel next Friday for a new gallery .",
        "summarized_comments": " The user bought $C to hedge his loan . He borrowed 12k to gamble on call options. He doesn't have much in options . He bought almost all shares, not options . Summarization not available for this chunk.  Earnings for this company unfortunately are irrelevant the stock moves based on more than fundamentals . Don't be dumb and greedy, you're right. The 14s are ITM not much to get crushed bro. The stock is going to make bank this week.",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9992567896842957,
        "created": "2024-03-25",
        "num_comments": 115,
        "ups": 1068,
        "downs": 0,
        "score": 1068,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnpmy0/citi_loan_update_12k/"
    },
    {
        "id": "1bnltq2",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "700k RDDT YOLO now green!",
        "selftext": "Was down 70k at one point but mama we made it",
        "summarized_selftext": " Was down 70k at one point but mama we made it, mama mama . \"We made it,\" she said. \"I was down 70,000\" She said she was \"down 70k\" when she found out she was pregnant .",
        "summarized_comments": " Inverse Reddit ftw: Niiiiiiiiiice. \"Cope harder loser\" \"Worse than you, cope harder loser!\" \"You are really stupid of course you can't buy puts on RDDT yet, regard you really are stupid\" \"Twitter is worth $41B and it’s run wayyyy worse than Reddit,\" says Reddit user . \"Pinterest is apparently worth way less than Reddit\" Summarization not available for this chunk. Summarization not available for this chunk.  It's likely not many shares are shorted but supply is limited so it can still rocket . Underwriters can't short for 30 days. Ordinary investors can, but if they do, they can get barred from further IPOs .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9995842576026917,
        "created": "2024-03-25",
        "num_comments": 170,
        "ups": 931,
        "downs": 0,
        "score": 931,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnltq2/700k_rddt_yolo_now_green/"
    },
    {
        "id": "1bnub6y",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Traders Tomorrow",
        "selftext": "",
        "summarized_selftext": "",
        "summarized_comments": "Summarization not available for this chunk.  The market is set to open on Monday . The market has been hit hard by the Fed's latest round of Fed action . The Fed will be able to pull a pull on the Fed on Tuesday night .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9942407608032227,
        "created": "2024-03-26",
        "num_comments": 65,
        "ups": 806,
        "downs": 0,
        "score": 806,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnub6y/traders_tomorrow/"
    },
    {
        "id": "1bnnb5l",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "What Are Your Moves Tomorrow, March 26, 2024",
        "selftext": "[View Post](https://www.reddit.com/r/wallstreetbets/post-viewer/1bnnb5l)",
        "summarized_selftext": " [View Post: http://www.reddit.com/r/wallstreetbets/post-viewer/1bnnb5l]",
        "summarized_comments": " The market is consolidating last week’s move before this moons again . Crypto gonna end up pumping this market higher with BTC halving soon . Rolling profits into Rumble earnings tomorrow, 8.5 calls 3/28 .  Trumpism is everything that is wrong with the world but let's help him rise up and destroy beauty of America . Every time he says \"Make America great\" he does not mean the America that most good people love .  Tesla putters in shambles, Tesla putter in shables and Tesla is in trouble . DJAC from 1040 to 1080 after closing. I expect a dump at open to 1060 and then a rally to 1100 with a slow melt down . DJT is going to be glorious when the mid-west finds out about some hot $DNUT's, it will be glorious .  It's sad poetic justice that the tragic bridge collapse happened in the most dysfunctional Dem-run city in America, Baltimore (see The Wire) The support beam was hit by a Singapore-flagged ship .  You will lose everything, you'll lose everything with DJT 6 pack? I probably should have bought more. You will probably have to buy more, you will lose all your money . You will never get back into the DJT.",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9890154004096985,
        "created": "2024-03-25",
        "num_comments": 8155,
        "ups": 797,
        "downs": 0,
        "score": 797,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnnb5l/what_are_your_moves_tomorrow_march_26_2024/"
    },
    {
        "id": "1bo5e4s",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "its not bitcoin neither rdde, its cocoa and it goes ballistic 🚀",
        "selftext": "",
        "summarized_selftext": "",
        "summarized_comments": " WSB Discord is a forum for Reddit users to discuss Redditors' views on Reddit . Join the forum for the weekly discussion of Redditors and users .  Cote D'Ivore and Ghana have had weak harvests for the 4th straight year . Continued deforestation for cocoa plantations has driven a cycle of increasing temperatures and drought . This has driven prices so high for beans that the companies that refine those beans into chocolate and ship it out to the world have simply stopped production in some cases . You can expect chocolate products to start inflating in price in the long term .  Cocoa prices doubled between July 2022 and April 2023 . Nestle, Mondelez &amp; Hershey; Hersheys; Nestle; Hershetz & Co. The price of cocoa has doubled 10-15% in a year .  Cocoa prices are like oil they go up and down impacting consumer spending . However oil is a limited resource, cocoa can be mass produced and production can be outsourced to some other area of the planet . Chocolate money will be worth more than money money .  Chocolate coins have more intrinsic value than Bitcoins . Cocoa is like stocks, buy high sell low, simple as that . Chocolate is more expensive without child slave labour on plantations .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9950730204582214,
        "created": "2024-03-26",
        "num_comments": 156,
        "ups": 792,
        "downs": 0,
        "score": 792,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bo5e4s/its_not_bitcoin_neither_rdde_its_cocoa_and_it/"
    },
    {
        "id": "1bo84mr",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "DJT $24,000 overnight",
        "selftext": "Originally spent $1700 on DWAC. Sold my $90 calls at about 700% gain. But held my $45 calls until this morning ",
        "summarized_selftext": " Originally spent $1700 on DWAC. Sold my $90 calls at about 700% gain . Sold $45 calls until this morning .",
        "summarized_comments": " Schwab system crashed this morning and showed the value of DJT as the Dow Jones Transportation ticker . My account value was up $4.4 million for 11 minutes before it was corrected . Schwab has the borrowing rate to short DJT at 184%.  First time option trade, but could have been another 1k in my pocket... I was trying to sell when the price hit 79. Ended up selling at around 71 on the phone . I still feel comfortable saying screw Robinhood. I got screwed by 20k+ when they paused GME .  The stock is trading on hype right now so you can make gains if you time it right . It's trading off the fact that \"the base\" will literally bleed themselves to make the price go up . There are further waves of dilution to come in the following months .  When do you think would be a good time to get puts on DJT? And at what strike price? The question is does Trump leave his people as bag holders before or after the election? Earliest he can sell is September I think . The DJT board can potentially waive his lockup at any time . Summarization not available for this chunk.  Wealthsimple hasn't updated the options yet so everyone holding them can’t sell until they do . Wealthsimple said it will be mid day before I can sell to close my options… But may be a blessing in disguise .  The market is going to zero, it's not a question of if this dogshit company will go to zero. It's a matter of when. The market will not hold long term though. I made money but I missed out on so so much more money.",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9990686774253845,
        "created": "2024-03-26",
        "num_comments": 259,
        "ups": 730,
        "downs": 0,
        "score": 730,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bo84mr/djt_24000_overnight/"
    },
    {
        "id": "1bo4xv2",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "20k YOLO - GMeeee",
        "selftext": "Title says it. ",
        "summarized_selftext": " Title says it says it doesn't say what it is, but the title says it does . Title says \"Title says it's not what it says, it's what the title means.\"",
        "summarized_comments": " WSB stock is already sniffing $14 ($15.03) The lord of dog food gets it into the 20s for a hot minute and then it goes back down to 10 bucks . It goes higher if the RSD number goes over the 70 milly its been stuck in eternity for eternity .  The primary reason for my yolo is I believe Q4 for gmeee was good with positive net margin . I also believe that the 1 billion in cash was invested in the market and gained a return in the last 3 months of 2023 . The stock has also atrophied significantly this year .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9838743209838867,
        "created": "2024-03-26",
        "num_comments": 58,
        "ups": 526,
        "downs": 0,
        "score": 526,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bo4xv2/20k_yolo_gmeeee/"
    },
    {
        "id": "1bnlbsu",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "First gains post. DWAC",
        "selftext": "I’ve already dropped a lot of calls. Should I sell out at this point?  JK HOLDING TIL DJT LETS GO TO THE MOON!!",
        "summarized_selftext": " I’ve already dropped a lot of calls. Should I sell out at this point?  JK HOLDING TIL DJT LETS GO TO THE MOON!!",
        "summarized_comments": " $10 million in shares traded hands today . DJT will not pay a single dime of that settlement . He has no choice in this one. He'll just break the rules and get out of the consequences somehow like every other time .  500 shares up $4,571.00 today. Also sold a 48.00 call. The real play is tmr when DJT comes u not to late my boy!  The stock market is about to open on Monday morning and trading has already been halted . Cory: \"It's too late to buy options on $DJT so let’s see what happens with this small batch of shares… cuz I'm not buying up at this point\"  The only real reason this stock took off today was because the NY Appellate court granted Trump an unprecedented concession by lowering his bond significantly . No one saw that coming, and the rally was a fluke that came out of left field .  Scroll this sub and look up every stock term you don't know . Read this sub to help you learn how to trade options . Follow us on Twitter @dailymailonline.com for more information .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9991600513458252,
        "created": "2024-03-25",
        "num_comments": 157,
        "ups": 366,
        "downs": 0,
        "score": 366,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnlbsu/first_gains_post_dwac/"
    },
    {
        "id": "1bnr07g",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "RDDT hit $69 LFGGG",
        "selftext": "",
        "summarized_selftext": "",
        "summarized_comments": " It was literally within 10 shares of 6,969 shares for sale at 69.69 on the ask . The rest  of y'all that went long must be eating rather well . It's early give it time. True longs won't take profit for at least a year .  Fidelity’s private funding round during peak COVID valued them at $10B at that point in time . PINS has a direct 3rd party seller revenue stream . They know they need to work on commerce next, and when they have it I will stop being a hater .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9948309063911438,
        "created": "2024-03-25",
        "num_comments": 80,
        "ups": 358,
        "downs": 0,
        "score": 358,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnr07g/rddt_hit_69_lfggg/"
    },
    {
        "id": "1bnnauw",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Update to my previous post🚀📈",
        "selftext": "Yes, It's unrealized. I know.  Holding until at least Wednesday morning. ",
        "summarized_selftext": " Yes, It's unrealized. I know.  Holding until at least Wednesday morning morning . Yes, it's not unrealized . Holding until Wednesday morning .",
        "summarized_comments": " Shares of WSB will go back to $18 or $19 on Wednesday . Earnings should beat expectations, resulting in a full year of profitability and positive EPS . Gains are gains. Gotta realize the gains before it evaporates .  It's too late to buy, but I'm very confident earnings will be amazing and it SHOULD send the stock higher . I will sell all of my near term options and hold my others until January 2025 . Good enough for a screenshot, good enough to take profits .",
        "comment_sentiment": "POSITIVE",
        "comment_sentiment_confidence": 0.9995408058166504,
        "created": "2024-03-25",
        "num_comments": 62,
        "ups": 287,
        "downs": 0,
        "score": 287,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnnauw/update_to_my_previous_post/"
    },
    {
        "id": "1bo8d5k",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "DJT broke Schwab",
        "selftext": "",
        "summarized_selftext": "",
        "summarized_comments": " There are two DJT tickers, one is trump social, the other is the down jones transportation index . They were briefly glitched to the same ticker and showed all of our stock options as up $15,800 . The funny part to me is if the total is 64.7k and DJT is 63.9k . The average return for SPACs was -18.8%, versus 37.2% for traditional IPOs .  Schwab turned off the buy button . Schwab is not available through Dow Jones Transportation . The market is up by 10,000$ but when I click on it it's just a black page .  This is such an obvious pump and dump so Trump can pay for his legal fees . Never attribute to malice that which can be adequately explained by incompetence . This whole market is a meme stock. Make your money while you can and get out!!  Trump 2024 because of gains from spacs? Let's gooooo! Trump 2024 . I’m also seeing no volume. I'm so sure there's no volume .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9992470741271973,
        "created": "2024-03-26",
        "num_comments": 106,
        "ups": 266,
        "downs": 0,
        "score": 266,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bo8d5k/djt_broke_schwab/"
    },
    {
        "id": "1bno1s9",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Yikes!!! There and back again! 2k-80k in two weeks.",
        "selftext": "Full goblin mode. Original plan for the week was gamestopp calls but I got a lil impatience…",
        "summarized_selftext": " Original plan for the week was gamestopp calls but I got a lil impatience… Full goblin mode . Original plan was to play a game of the week, but got impatient and got impatient .",
        "summarized_comments": " NVM thought from the title he lost it all. \"I want pizza and a large coke please\" \"I'm down from 60k to 2k so your post is giving me hope,\" says NVM .  The bigger the amount of money, the harder it is to make these types of gains . Doing a 200-300% gain with $1000 in a day is very different than doing it with 2-3 million . Supply and demand are hard to buy and sell thousands of calls or puts .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9903400540351868,
        "created": "2024-03-25",
        "num_comments": 63,
        "ups": 242,
        "downs": 0,
        "score": 242,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bno1s9/yikes_there_and_back_again_2k80k_in_two_weeks/"
    },
    {
        "id": "1bo4c2t",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Daily Discussion Thread for March 26, 2024",
        "selftext": "[View Post](https://www.reddit.com/r/wallstreetbets/post-viewer/1bo4c2t)",
        "summarized_selftext": " [View Post: http://www.reddit.com/r/wallstreetbets/post-viewer/1bo4c2t]",
        "summarized_comments": "Summarization not available for this chunk.  Puts aren't shares. Puts are 100 shares. We are not psychics. They went right to offering weeklies on DJT cause well you know...*You're calls gonna get rekt. You're\\* better than that. The problem with waiting for the dip, is that it never fucking comes!  \"Get the fUK in boys\" \"DJT to $100. DJT is too expensive to be playing straddles\" \"I am straight up not having a good time. I am sorry I hated you this morning. I didn’t mean any of it\" \"This is still so cheap. Hop in and thank me\"  The huge sell volume on puts around the 965 level has evaporated so expecting it to climb higher to 985-990 levels once there is some price momentum . AMD better not pull a reverse uno card and end up red like the last couple days .  AMD is up from 13 in a day to +3% V with a casual +3%, V ! The market is more regarded every passing day.. efficient market my ass .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.999407172203064,
        "created": "2024-03-26",
        "num_comments": 8519,
        "ups": 241,
        "downs": 0,
        "score": 241,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bo4c2t/daily_discussion_thread_for_march_26_2024/"
    },
    {
        "id": "1bnufax",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-03-26",
        "title": "Benzinga Newswire quoting WSB members about DWAC/DJT",
        "selftext": "Shoutout to u/RainGator, u/TheSavageBeast83, u/Chester-Ming, and u/ireddit2014",
        "summarized_selftext": " Shoutout to u/RainGator, TheSavageBeast83, u/TheSavage Beast83, and u/ireddit2014 .",
        "summarized_comments": " The WSB Daily Discussion is a Reddit forum for Reddit users . Join in at least 4 times a week to comment on Reddit . The Daily Discussion has been running for three years .  Truth / DWAC / DJT = 5 million monthly Visitors. #1118 Alexa Rank. Truth is not Trump's Real Estate empire. Your buying Truth Social Media, not Trump’s Real Estate . The number one followed person is known to lie more than the devil himself .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9958528280258179,
        "created": "2024-03-26",
        "num_comments": 59,
        "ups": 216,
        "downs": 0,
        "score": 216,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1bnufax/benzinga_newswire_quoting_wsb_members_about/"
    },
    {
        "id": "1bnnaqp",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Is opening a backdoor Roth a good plan?",
        "selftext": "I can’t do an IRA because I’m over the income limit. Maxing the 401k and HSA. I have previously never opened an IRA. \n\nIs a backdoor Roth a smart idea? Can someone give me a more layman idea as to why that might be a good vehicle to invest in. \n\nWhat other strategies would you advise? \n\nCurrently im maxed on the 401k, hsa. Any other areas? Is RE next?",
        "summarized_selftext": " I can't do an IRA because I’m over the income limit . I have previously never opened an IRA . Currently maxed on the 401k and HSA . Is a backdoor Roth a smart idea? Is RE next?",
        "summarized_comments": " An IRA is about the only tax-advantaged option you have left if you want to put more money away for retirement . Paying less taxes is generally better than paying more taxes . Backdoor Roth is really a no-brainer with that context .  Rolling over your Trad IRA to a 401(k) has 0 tax liability, and it opens up the ability to do a backdoor Roth . It will only be a bad idea if your 401K is truly terrible . Converting to a Roth significantly changes your mix of investment accounts and potentially greatly affects your taxes .  The only tax benefit you can get is to do a backdoor Roth and have your money grow tax free . But it’s not as often as good idea as it sounds. There is no income limit to contribute to a traditional IRA (for now)",
        "comment_sentiment": "POSITIVE",
        "comment_sentiment_confidence": 0.9866495728492737,
        "created": "2024-03-25",
        "num_comments": 28,
        "ups": 13,
        "downs": 0,
        "score": 13,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnnaqp/is_opening_a_backdoor_roth_a_good_plan/"
    },
    {
        "id": "1bo9iqa",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "I have a small IRA with 65k and I'm considering investing some or all in a bond fund. What do you all think?",
        "selftext": "I'm about to retire in a month and have a small IRA (in addition to other IRAs - traditional and Roth). This small IRA is for a future car purchase (or two).  I expect to need another car in two to five years.  \nI was thinking of FXNAX. Right now it's in Sprxx. It appears that interest rates will come down sometime this year. Would going with a bond fund suit my needs?",
        "summarized_selftext": " I'm about to retire in a month and have a small IRA (in addition to other IRAs - traditional and Roth) This small IRA is for a future car purchase (or two) I expect to need another car in two to five years . Would going with a bond fund suit my needs?",
        "summarized_comments": " FXNAX expense is 0.03, yield is 3.06; 7 day yield is 5.03; Sprxx expense is $0.42 . If you buy a brokerage CD, it’s priced like a bond, so if rates go down, you can sell it for a profit .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9970496892929077,
        "created": "2024-03-26",
        "num_comments": 4,
        "ups": 13,
        "downs": 0,
        "score": 13,
        "permalink": "https://www.reddit.com/r/investing/comments/1bo9iqa/i_have_a_small_ira_with_65k_and_im_considering/"
    },
    {
        "id": "1bo994x",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "ABLE Investment Account Fees",
        "selftext": "I recently learned about ABLE accounts, which are essentially tax-advantaged savings and investment accounts for people with disabilities. Normally, the U.S. government is very restrictive about disability savings. In order to qualify for SSI, you must have less than $2k in assets for instance. ABLE assets don't count towards that limit until after the balance goes over $100k.\n\nEach state appears to have their own ABLE system, and it looks like some states allow non-residents to utilize their programs. I'm trying to help a disabled friend make the best choices and I'd like to compare fee structures on the investments across ABLE systems. I haven't found a good way to do that yet. I'd like to find out which state(s) with non-resident reciprocity have the lowest expense ratios, that way my friend can make an informed decision about whether to use their state's program, or a different one with lower fees. Does anyone have much experience with ABLE? Any help or insight would be greatly appreciated.",
        "summarized_selftext": " I recently learned about ABLE accounts, which are essentially tax-advantaged savings and investment accounts for people with disabilities . Each state appears to have their own ABLE system, and some states allow non-residents to utilize their programs .",
        "summarized_comments": " I have no experience with ABLE accounts . I did run into this comparison tool in the past - [https://www.ablenrc.org/compare-states/]",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9993860721588135,
        "created": "2024-03-26",
        "num_comments": 1,
        "ups": 5,
        "downs": 0,
        "score": 5,
        "permalink": "https://www.reddit.com/r/investing/comments/1bo994x/able_investment_account_fees/"
    },
    {
        "id": "1bo382z",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Daily General Discussion and Advice Thread - March 26, 2024",
        "selftext": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n* How old are you? What country do you live in?  \n* Are you employed/making income? How much?  \n* What are your objectives with this money? (Buy a house? Retirement savings?)  \n* What is your time horizon? Do you need this money next month? Next 20yrs?  \n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n* Any big debts (include interest rate) or expenses?  \n* And any other relevant financial information will be useful to give you a proper answer.  \n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq\nAnd our [side bar](https://www.reddit.com/r/investing/about/sidebar) also has useful resources.  \n\nIf you are new to investing - please refer to Wiki - [Getting Started](https://www.reddit.com/r/investing/wiki/index/gettingstarted/)\n\nThe reading list in the wiki has a list of books ranging from light reading to advanced topics depending on your knowledge level. Link here - [Reading List](https://www.reddit.com/r/investing/wiki/readinglist)\n\nCheck the resources in the sidebar.\n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "summarized_selftext": " If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" please include relevant financial information . If you are new to investing - please refer to Wiki - [Getting Started] The reading list in the wiki has a list of books ranging from light reading to advanced topics .",
        "summarized_comments": " An airline employee has an employee stock ownership program . The company matches 33.33% of his pay and gives him additional shares . If this is not part of a KSOP - the 33% contribution is taxable as income .  If I buy 2 shares ($10.5k) right now and let it sit for 35 years, never investing another dollar, it will grow to apprx. $80.7k assuming a 6% return and $112.1k . The S&amp;P usually returns at 10% but to adjust to 6% or 7% for inflation, which is why I used those calculations . You are not *guaranteed* that return in 35 years .  $10.5k at 7% annually is $121k after 35 years, but $100 added each month is over $300k in 35 years . Getting started early is great, but consistency over time is also key . If you held this in a \"taxable\" account, your investment would be subject to *slight* taxation .  Every four years, the Bitcoin network experiences an event known as the “Halving” The fourth Bitcoin halving is set to happen on April 19th, 2024 . The halving isn't reducing the available coins, it's reducing the rate at which they are created .  I did want to invest in some stocks and keep them for at least 15-20 years . Can you guys name some good value stocks? Both high and low risk ones would be much appreciated .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9964739680290222,
        "created": "2024-03-26",
        "num_comments": 23,
        "ups": 5,
        "downs": 0,
        "score": 5,
        "permalink": "https://www.reddit.com/r/investing/comments/1bo382z/daily_general_discussion_and_advice_thread_march/"
    },
    {
        "id": "1bnixm3",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Which bond funds should I pick (Fidelity)?",
        "selftext": "I already decided I will go with FSKAX and FTIHX for my Fidelity Roth IRA because they are total market funds and include small caps. I can't seem to find a bond index fund that is as broad? Can anyone recommend 1-3 bond funds that would offer a similar level of bond market diversification?",
        "summarized_selftext": " I already decided to go with FSKAX and FTIHX for my Fidelity Roth IRA because they are total market funds and include small caps . I can't seem to find a bond index fund that is as broad? Can anyone recommend 1-3 bond funds that would offer a similar level of bond market diversification?",
        "summarized_comments": " If you are fairly young like in twenties and you want bonds I think long term treasuries aren’t a bad idea . If you want to stick with Fidelity funds, there are Fidelity U.S. Bonds Index (FXNAX) and Fidelity International Bond Index (FBIIX)",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9793376922607422,
        "created": "2024-03-25",
        "num_comments": 9,
        "ups": 4,
        "downs": 0,
        "score": 4,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnixm3/which_bond_funds_should_i_pick_fidelity/"
    },
    {
        "id": "1boarkf",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "What do I do with DWACW (Now DJTWW)?",
        "selftext": "Back when DWAC went hot in 2021, I bought and sold it and made about $2500. I ended up also buying DWACW 8 shares at $70 a share. It is now DJTWW. Price is $26, and DJT is $70. DJT is up 40% today but DJTWW only $10%.\n\nAs embaressing as it is, I dont really understand what it is besides it being a warrant which I dont actually understand lol",
        "summarized_selftext": " DWAC went hot in 2021, I bought and sold it and made about $2500 . I ended up also buying DWACW 8 shares at $70 a share . Price is $26, and DJTWW is $70. DJT is up 40% today .",
        "summarized_comments": " For 11.50 you can exercise this warrant and turn it into a share . You can only exercise if the merger goes through . The merger went through so there is no risk buying the warrants now . I don't understand why they are still available for purchase?",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9924341440200806,
        "created": "2024-03-26",
        "num_comments": 3,
        "ups": 3,
        "downs": 0,
        "score": 3,
        "permalink": "https://www.reddit.com/r/investing/comments/1boarkf/what_do_i_do_with_dwacw_now_djtww/"
    },
    {
        "id": "1bo7hhq",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Short fund wants to replicate gains by -1x but movement is double (-2x) underlying fund. What's going on?",
        "selftext": "\n\nBITI is a short-play on Bitcoin, BTC. The fund's description says it seeks to do the exact opposite of what bitcoin price does. Is Bitcoin goes up 3%, BITI should go down 3%, etc.\n\nYesterday Bitcoin went up 5.5% yet BITI lost over 11%, double what the fund objective is.\n\nHow is this possible?",
        "summarized_selftext": " BITI is a short-play on Bitcoin, BTC . The fund's description says it seeks to do the exact opposite of what bitcoin price does . Bitcoin went up 5.5% yet BITI lost over 11%, double what the fund objective is .",
        "summarized_comments": " The fund is going to lose money whenever Bitcoin rises regardless of time of day . Short sellers aren't immune to \"the greeks\" and will lose money to achieve their (negative) position .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.999177873134613,
        "created": "2024-03-26",
        "num_comments": 3,
        "ups": 4,
        "downs": 0,
        "score": 4,
        "permalink": "https://www.reddit.com/r/investing/comments/1bo7hhq/short_fund_wants_to_replicate_gains_by_1x_but/"
    },
    {
        "id": "1bnx3iq",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Municipal bond ETF tax treatment?",
        "selftext": "Hi, are there any special tax treatments for ETF capital gains that’s composed of municipal bonds, including bits of Guam and maybe Puerto Rico weighting? What are usually believe is capital gains or just capital gains and special treatment comes from interest or distributions \n\nThe monthly distributions would receive exempt treatment calculated according to the weighted percentage of my state’s bond % of the total, but not the point. \nTy ",
        "summarized_selftext": " Are there any special tax treatments for municipal bonds that’s composed of municipal bonds, including bits of Guam and maybe Puerto Rico weighting? What are usually believe is capital gains or just capital gains and special treatment comes from interest or distributions .",
        "summarized_comments": " I bought VTEB awhile back. It is income tax exempt. The yields are lower as result. This only makes sense when you are in a higher tax bracket . I'm less sure on cap gains if you straight up sell .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9993138313293457,
        "created": "2024-03-26",
        "num_comments": 1,
        "ups": 2,
        "downs": 0,
        "score": 2,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnx3iq/municipal_bond_etf_tax_treatment/"
    },
    {
        "id": "1bnontp",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Utah 529 plans - when/how much to invest?",
        "selftext": "Considering which of these options to choose:\n\n1. Invest a set amount every week starting April through December\n\n2. Invest a set amount every other week Apr-Dec\n\n3. Invest a set amount every month Apr-Dec\n\n4. Invest ad hoc Apr-Dec\n\n5. Keep saving through Dec in a money-market/HYSA and invest lump sum on ~12/15\n\nIn addition, I am considering investing a lump sum in ~Nov/Dec based on my financial situation at the time (after 401K/emergency funds/IRA/etc. are all re-calculated and sorted for the year if I have any extra money to put into 529).\n\nMoney will not be taken out for at least another 15+ years.",
        "summarized_selftext": " Money will not be taken out for at least another 15+ years . Investing a set amount every week starting April through Dec in a money-market/HYSA and investing lump sum on 12/15/12/15 .",
        "summarized_comments": " Utah's My529 ranks gold in MorningStar's 529 annual review . $14k principle investment (spread out over years) is now over ~~$31k~~  $32k",
        "comment_sentiment": "POSITIVE",
        "comment_sentiment_confidence": 0.6647113561630249,
        "created": "2024-03-25",
        "num_comments": 9,
        "ups": 2,
        "downs": 0,
        "score": 2,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnontp/utah_529_plans_whenhow_much_to_invest/"
    },
    {
        "id": "1bnjnwl",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Advice for learning options - Piranha Profits",
        "selftext": "I’m looking to increase my ability to invest and make more money on a consistent basis and came across Piranha Profits online. I do have a finance degree so I have a basic understanding of options but what I want is experienced insight and strategies in different market situations to employ options with and turbo charge how much I make in a way that is still sort of safe when using options. I like cautious and easy insightful risk. Found out the Piranha Profits course costs like 3 grand. Seems like a bit of a grift. Anyone have any input on whether it’s worth it or not? Are there better alternatives out there which not only teach the basics of options but also experienced strategies?? Thanks in advance!!!",
        "summarized_selftext": " Piranha Profits course costs like 3 grand. Seems like a bit of a grift. Anyone have any input on whether it’s worth it or not? Are there better alternatives out there which not only teach the basics of options but also experienced strategies?",
        "summarized_comments": " There is definitely money to be made in options trading, but the risk/reward is significantly higher . There is no proven system of using options to make money on a risk-adjusted basis that exceeds the market average .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9135969877243042,
        "created": "2024-03-25",
        "num_comments": 6,
        "ups": 3,
        "downs": 0,
        "score": 3,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnjnwl/advice_for_learning_options_piranha_profits/"
    },
    {
        "id": "1bnhcof",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Seeking advice on holding insurance stocks when a low-interest season starts",
        "selftext": "Hi together, \n\nI'm curious what you think about continuing to hold well-performing insurance stocks, even though a turnaround in interest rates is expected this year.\n\nSince the pandemic, I've held shares in Axa, Allianz and Munich RE. And they all make a significant portion of their profits through low-risk capital gains. As someone who has studied International Finance, I know that a low-interest rate environment is theoretically not optimal for insurance companies, as they have to take on more risk to achieve the same return. But how will this affect the share price in practical terms? I mean, I assume this is already priced into the current share price.   \nI'm just curious what you would do.\n\nI am grateful for any constructive advice!\n\n&amp;#x200B;",
        "summarized_selftext": " Since the pandemic, I've held shares in Axa, Allianz and Munich RE . I assume this is already priced into the current share price .",
        "summarized_comments": " There is definitely money to be made in options trading, but the risk/reward is significantly higher . There is no proven system of using options to make money on a risk-adjusted basis that exceeds the market average .",
        "comment_sentiment": "Neutral",
        "comment_sentiment_confidence": 0,
        "created": "2024-03-25",
        "num_comments": 0,
        "ups": 2,
        "downs": 0,
        "score": 2,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnhcof/seeking_advice_on_holding_insurance_stocks_when_a/"
    },
    {
        "id": "1boalt7",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Retirement Plans and Portfolios",
        "selftext": "I'm an independent contractor and filed a 1099-NEC this year.\n\nCurrently, my client hasn't offered to create and match 401k funding, so I've decided to look into starting my own.\n\nWhat type of Roth, 401k, or investment would you recommend for a 5-10 year plan?",
        "summarized_selftext": " I'm an independent contractor and filed a 1099-NEC this year . I've decided to look into starting my own 401k fund .",
        "summarized_comments": " Your submission has been automatically removed because the URL matches one on the /r/Investing banlist due to low quality content or has been used to spam . Please be aware that if your post can be sourced from a less sensationalist publication we will likely require you to do that .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9996613264083862,
        "created": "2024-03-26",
        "num_comments": 2,
        "ups": 2,
        "downs": 0,
        "score": 2,
        "permalink": "https://www.reddit.com/r/investing/comments/1boalt7/retirement_plans_and_portfolios/"
    },
    {
        "id": "1bo6gh1",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Why doesn't $TSMWF properly convert from Taiwanese dollar to USD?",
        "selftext": "I'm looking at $TSMWF which currently has a share price of $17.24. The analyst target prices are listed as an average of $795.\n\nI assume this is due to it being traded on the Taiwanese exchange (TWSE) as well as NYSE. I converted the current $780 TWSE share price of $780 to USD and it's $24.18 which is still off from the current NYSE share price.\n\nCan someone enlighten me?",
        "summarized_selftext": " The current share price of $17.24 is still off from the current $24.18 . The target prices are listed as an average of $795.24 .",
        "summarized_comments": " The price that you see for TSMWF isn't valid because there havent' been any transactions on in nearly a year . In the US markets - it doesn't make sense to trade or hold an illiquid and unlisted F share if a listed ADR is available .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9997232556343079,
        "created": "2024-03-26",
        "num_comments": 1,
        "ups": 1,
        "downs": 0,
        "score": 1,
        "permalink": "https://www.reddit.com/r/investing/comments/1bo6gh1/why_doesnt_tsmwf_properly_convert_from_taiwanese/"
    },
    {
        "id": "1bnkqzr",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Non Principal Protected Note",
        "selftext": "My parents are filing their taxes and their financial advisor invested in a Non Principal Protected Note. The Note matured but it is also showing a “short sale ended” in part of the line item. It ended up “maturing” or “selling” (I’m not exactly sure) at a 26% loss. \n\nDoes anyone know what this means?  Also, is this a good investment vehicle for someone in their 70’s because a 26% loss seems awful?",
        "summarized_selftext": " My parents are filing their taxes and their financial advisor invested in a Non Principal Protected Note . The Note matured but it also showed a “short sale ended” in part of the line item . It ended up “maturing” or “selling” at a 26% loss .",
        "summarized_comments": " Ask for a meeting with your financial advisor and go through the following questions . Ask the FA why this was an appropriate investment based on the client's retirement needs . If they aren't a fiduciary then they have no obligation to put their client's interest above their own .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9921497106552124,
        "created": "2024-03-25",
        "num_comments": 1,
        "ups": 1,
        "downs": 0,
        "score": 1,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnkqzr/non_principal_protected_note/"
    },
    {
        "id": "1bo2p4u",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "ETF in USD: buy in EUR or in USD",
        "selftext": "My question is: for a USD based ETF does this make any difference and if yes which, if I buy it in different exchanges in EUR or in USD?\n\nExample:\nI am interested in iShares Core S&amp;P500 UCITS ACC.  It is listed with two tickers, SXR8 in XEXTRA in € and also as CSPX in LSE in $.\n\nI tend to believe that buying an USD based ETF in USD would be beneficial but I don’t know why, especially when my base currency is EUR.",
        "summarized_selftext": " The iShares Core S&amp;P500 UCITS ACC is listed with two tickers, SXR8 in XEXTRA in € and also as CSPX in LSE in $ . My question is: for a USD based ETF does this make any difference?",
        "summarized_comments": " The currency of an ETF is absolutelly irrelevant... you should make that choise exclusively based on which currency you are paid in, or you have available, to avoid spending money to convert currency . The underlying currency of the individual stocks poses a currency risk, not the listed currency .  The value of my investment stays the same, irrespective of the currency valuation . Current macro economic markers are pretty good for the US but for Europe not so much . Falling birth rates and rising energy cost are one of the main drivers .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9995284080505371,
        "created": "2024-03-26",
        "num_comments": 16,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/investing/comments/1bo2p4u/etf_in_usd_buy_in_eur_or_in_usd/"
    },
    {
        "id": "1bnluiz",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Election Stock Spikes and Drops",
        "selftext": "Are there any types of stocks that you usually see go way up or fall way down when an election occurs? I've been doing a lot of reading and I'm going to do some single company investments across a broad spectrum of categories, closer to the election on the off chance that somebody balloons up on the night of. ",
        "summarized_selftext": " Are there any types of stocks that you usually see go way up or fall way down when an election occurs? I've been doing a lot of reading and I'm going to do some single company investments closer to the election on the off chance that somebody balloons up on the night of .",
        "summarized_comments": " The VIX is going to be elevated all during the run up to the election. That's almost a guarantee and it’s been the case with pretty much any election I’ve seen. But don’t trust those mongooses, man. They just want the election over .",
        "comment_sentiment": "POSITIVE",
        "comment_sentiment_confidence": 0.9440514445304871,
        "created": "2024-03-25",
        "num_comments": 3,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnluiz/election_stock_spikes_and_drops/"
    },
    {
        "id": "1bnxhvb",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "If your broker doesn’t allow 4 multi-leg trades are box spreads still worth it?",
        "selftext": "I’m using fidelity. Unfortunately I can only execute 2 legged trades at a time. Wouldn’t that dramatically increase risk as the box spread runs the risk of only being partially filled? I wasn’t trying to do anything insanely risky. Just leverage up my NTSX position by a small amount so my total leverage is 1.8x instead of 1.5x. ",
        "summarized_selftext": " I wasn’t trying to do anything insanely risky. Just leverage up my NTSX position by a small amount so my total leverage is 1.8x instead of 1.5x . Unfortunately I can only execute 2 legged trades at a time .",
        "summarized_comments": " Fidelity's cross-margining is horrible for long box positions . You can do more than 2 legged spreads on Fidelity like iron condors .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9980003237724304,
        "created": "2024-03-26",
        "num_comments": 1,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnxhvb/if_your_broker_doesnt_allow_4_multileg_trades_are/"
    },
    {
        "id": "1bo30s1",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "What do you all think about SiriusXM (SIRI)?",
        "selftext": "I bought it a few times about about 15 years ago around $1.80-$2.20 and sold it around $7.00 like 5 years ago(?) and I’m wondering if now is a good time to get back in since it’s down to $3.90. \nPlus, sometimes people talking about how good it is but it’s not worth the cost and comparing it to using iHeartRadio. But at least it’s EPS is in the positive.",
        "summarized_selftext": " I bought it a few times about about about 15 years ago around $1.80-$2.20 and sold it around $7.00 like 5 years ago . I’m wondering if now is a good time to get back in since it’s down to $3.90 .",
        "summarized_comments": " Most boomers call for discounts - I get mind for $5/month - I call and simply say I can stream Spotify or other for $7 . Dont think it is in immediate danger of bankruptcy, but doubt there is anymore room for improvement in profit .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.99864262342453,
        "created": "2024-03-26",
        "num_comments": 13,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/investing/comments/1bo30s1/what_do_you_all_think_about_siriusxm_siri/"
    },
    {
        "id": "1bo8wca",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Curious how/if people sell/rebalance positions with a ROTH",
        "selftext": "I have a nice gain in MSFT over the past 10 years. I do think this company is a very solid long term hold going forward, but it is now almost 12% of my wife and I's retirement. Would it ever make sense to sell a chunk to rebalance it to a lower percentage? Just wondering what the general consensus is? I look at blue chips like this as real estate and try and stick to the \"never sell\" mentality, but always open to learning and hearing what others think and do :) TIA!",
        "summarized_selftext": " I have a nice gain in MSFT over the past 10 years . I do think this company is a very solid long term hold going forward . But it is now almost 12% of my wife and I's retirement. Would it ever make sense to sell a chunk to rebalance it to a lower percentage?",
        "summarized_comments": " With a tax-advantaged account, rebalancing will not create a taxable event . If you feel overly concentrated, just sell all or a portion of your shares and buy something more diversified . Buy a total market index fund, and sleep better at night .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9992701411247253,
        "created": "2024-03-26",
        "num_comments": 8,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/investing/comments/1bo8wca/curious_howif_people_sellrebalance_positions_with/"
    },
    {
        "id": "1bnwz4r",
        "subreddit": "investing",
        "upload_date": "2024-03-26",
        "title": "Coinbase Puts: Your Opinion. ",
        "selftext": "Title but, \n\nSeeing bitcoin fluctuations almost directly follow with BTC I had an idea that I wanted to chat about.  \n\nBuying long Coinbase puts, say 1 year out minimum, looking more towards 1.5 years. \n\n-the most overvalued large cap stock based on p/e, sales and book value. \n- analyst projections of growth rates are minimal\n- volatility probably hasn’t even peaked yet either, speculating here though. \n\nPotentially more run time before the top, but even that said, it most likely will collapse below current prices. \n\nI don’t hang around any sort of crypto stuff, knowledgeable on the halving, or even know estimates of what people think it’s gonna run till.\n\nBut based on fundamentals alone &amp; history of BTC price fluctuations, long Coinbase puts seem completely viable options gamble if you only allocate a percentage your willing to lose. Let alone, if you hold Coinbase stock or bitcoin in the long term, a hedge might do you well. \n\nLet’s chat! ",
        "summarized_selftext": " Bitcoin volatility hasn’t even peaked yet either, speculating here though though . The most overvalued large cap stock based on p/e, sales and book value . Bitcoin most likely will collapse below current prices .",
        "summarized_comments": " Bitcoin halving is soon, and that usually triggers a bull run in crypto for a few months . If you buy puts expect to lose that bet but at least there is limited downside risk . Bitcoin is already priced in, and the halving will do nothing and then they will move on to new story to hype it up .  It seems as if the crypto bull run has just began, but there are a lot of reasons to believe it will be a thing . With that said, it's definitely going up, until the euphoria in the markets goes back down . The company just isn't that good, and it’s run by a guy who really isn’t all that smart .",
        "comment_sentiment": "NEGATIVE",
        "comment_sentiment_confidence": 0.9894871711730957,
        "created": "2024-03-26",
        "num_comments": 29,
        "ups": 0,
        "downs": 0,
        "score": 0,
        "permalink": "https://www.reddit.com/r/investing/comments/1bnwz4r/coinbase_puts_your_opinion/"
    }
]