[
    {
        "id": "1b2hsi4",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "Snowflake says Frank Slootman is retiring as CEO; stock plunges 20%",
        "selftext": "Snowflake said Wednesday that CEO Frank Slootman is retiring, and will be replaced by Google ad chief Sridhar Ramaswamy. The shares plunged 20% in extended trading.\n\nRamaswamy spent 15 years at Google, most recently leading Ads and Commerce until 2018. He then left to co-found Neeva in 2019, a consumer search engine he hoped to rival Google until last year, when he announced he was shutting it down. \n\nSnowflake acquired Neeva in June for an undisclosed price.\n\nSource: https://www.cnbc.com/2024/02/28/snowflake-says-frank-slootman-is-retiring-as-ceo-stock-plunges-20percent.html",
        "created": "2024-02-28",
        "num_comments": 128,
        "ups": 778,
        "downs": 0,
        "score": 778,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b2hsi4/snowflake_says_frank_slootman_is_retiring_as_ceo/"
    },
    {
        "id": "1b2dv7t",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "Google hit with $2.3 bln lawsuit by Axel Springer, other media groups",
        "selftext": "https://www.reuters.com/technology/google-hit-with-23-bln-lawsuit-by-axel-springer-other-media-groups-2024-02-28/\n\n&gt;The move by the group - which include publishers in Austria, Belgium, Bulgaria, the Czech Republic, Denmark, Finland, Hungary, Luxembourg, the Netherlands, Norway, Poland, Spain and Sweden - comes as antitrust regulators also crack down on Google's ad tech business.\n\n\nGemini and now this.\n\nI wonder to what extent this could hurt their ads revenues in the long term... Seems more serious than the Gemini stuff.\n\n",
        "created": "2024-02-28",
        "num_comments": 86,
        "ups": 403,
        "downs": 0,
        "score": 403,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b2dv7t/google_hit_with_23_bln_lawsuit_by_axel_springer/"
    },
    {
        "id": "1b2knaw",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "EA to lay off 5% of workforce, or about 670 employees",
        "selftext": "Electronic Arts\n announced Wednesday that it will cut 5% of its workforce, part of a plan that includes reducing office space and ending work on some video games.\n\nEA employed 13,400 workers as of the end of March 2023, according to its most recent annual filing with the U.S. Securities and Exchange Commission in May. That means the layoffs may affect about 670 jobs.\n\nThe company’s announcement marks the latest headcount reduction among video game developers in recent months, continuing a broader trend of significant downsizing across the tech industry. \n\nOn Tuesday, Sony said it would lay off about 900 employees in its PlayStation division, or 8% of its workforce. Last month, Microsoft cut 1,900 jobs across its gaming unit three months after it acquired Activision Blizzard, and Tencent’s Riot Games slashed 11% of its workforce.\n\nEA CEO Andrew Wilson wrote in a memo to employees on Wednesday that the video game company is “streamlining our company operations to deliver deeper, more connected experiences for fans everywhere.”\n\nThe cuts will support EA’s “strategic priorities and growth initiatives,” according to a Wednesday filing with the SEC. The company expects its restructuring plan will be “substantially complete” by the end of December.\n\n“We are continuing to optimize our global real estate footprint to best support our business,” Wilson wrote in his Wednesday note. “We are also sunsetting games and moving away from development of future licensed IP that we do not believe will be successful in our changing industry.”\n\nWilson added that the cuts will enable EA to focus more on its “biggest opportunities — including our owned IP, sports, and massive online communities.” \n\nDuring the company’s third-quarter earnings call last month, Wilson said the company would focus on continuing to invest in its existing gaming franchises attracting large online audiences, including Apex Legends, Battlefield, EA Sports FC, Madden NFL and The Sims.\n\nSource: https://www.cnbc.com/2024/02/28/ea-layoffs-company-to-cut-5percent-of-workforce-or-about-670-employees.html",
        "created": "2024-02-28",
        "num_comments": 62,
        "ups": 300,
        "downs": 0,
        "score": 300,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b2knaw/ea_to_lay_off_5_of_workforce_or_about_670/"
    },
    {
        "id": "1b27suh",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "Stripe all but delays IPO. Valuation rises to $65B",
        "selftext": "\n\nFeb 28 (Reuters) - Stripe's valuation surged to $65 billion in a deal that will allow some of its employees to cash out their stock in the company, the payments service provider said on Wednesday.\nThe so-called \"tender offer\" could allow Stripe more flexibility with its plans to file for an initial public offering (IPO), which investors and analysts have been anticipating for years.\nStock-based payouts typically comprise a big chunk of the compensation for startup employees, who have no way of converting their shares into cash unless their employer files for an IPO, raises funds in a private round or buys back their shares.\nStripe and some of its investors have agreed to buy some shares of current and former Stripe employees, the company said.\nIt did not disclose the names of the investors participating in the round. But the Wall Street Journal, which first reported the deal, said Sequoia Capital and Goldman Sachs's growth equity fund were involved.\nStripe declined to comment beyond its statement.\nThe company was valued at $50 billion in its last funding round in 2023 where it raised $6.5 billion. It had then said that it did not need the capital to run its business but would use it to cover a tax bill and to provide liquidity to employees.\n\nhttps://www.reuters.com/technology/stripe-valuation-jumps-65-bln-employee-share-sale-deal-wsj-2024-02-28/",
        "created": "2024-02-28",
        "num_comments": 63,
        "ups": 226,
        "downs": 0,
        "score": 226,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b27suh/stripe_all_but_delays_ipo_valuation_rises_to_65b/"
    },
    {
        "id": "1b2hr1z",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "Salesforce follows Meta..announces dividend!",
        "selftext": "Salesforce ($CRM) initiates a Quarterly Dividend of $0.40 per share (~ 0.53% yield)\n\nAlso announced share repurchase Program Authorization Increased by $10 Billion\n\nLink: https://www.businesswire.com/news/home/20240228722646/en/Salesforce-Announces-Strong-Fourth-Quarter-Fiscal-2024-Results#:~:text=Salesforce's%20Board%20of%20Directors%20declared,business%20on%20March%2014%2C%202024",
        "created": "2024-02-28",
        "num_comments": 26,
        "ups": 188,
        "downs": 0,
        "score": 188,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b2hr1z/salesforce_follows_metaannounces_dividend/"
    },
    {
        "id": "1b24tan",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "Reddit's IPO - The most important details &amp; red flags",
        "selftext": "It has been a while since there was an exciting IPO, but finally, there is one. \n\nI went through the Reddit prospectus, and here's my summary of Reddit as a company, the IPO, and some of the red flags I saw.\n\n&amp;#x200B;\n\nThe post will be divided into the following segments:\n\n**- Current business model**\n\n\\- **Future business model**\n\n\\- **Analysis of financial statements**\n\n\\- **Why IPO?**\n\n**- The IPO strategy**\n\n**- Sam Altman**\n\n**- Valuation**\n\n&amp;#x200B;\n\n**Current business model**\n\nReddit's primary revenue source is - advertising. In 2023, it accounted for 98% of the $804 million in revenue. The remaining 2% comes from Reddit premium subscriptions, as well as products within the user economy (Reddit Gold / Avatars).\n\nGiven the significance of the advertising revenue stream, let's focus on that. The simple formula that can be derived is: **Number of users** multiplied by **Average revenue per user**. \n\nThese are the two most important numbers that any investor needs to focus on when analyzing almost any advertising business.\n\nLet's start with the number of users. In an ideal world, we should know the exact number of users, and divide that with the potential user size. This will allow us to calculate the so-called \"penetration rate\". So, if the penetration rate is 10% for example, it indicates that the company has plenty of room to grow.\n\nReddit discloses two metrics: DAUq (Daily active uniques) and WAUq (Weekly active uniques). This could be seen as the first red flag. Here's why:\n\nIf we define the market size as users who are above the age of 14, that's over 270 million in the U.S.\n\nThe U.S. daily active uniques are 36 million. Hence, if we use these metrics, the penetration rate is about **13%**.\n\nHowever, if we use the weekly active uniques, we get to a penetration rate of almost **50%** (131 million WAUq).\n\nSo, which one is it?\n\nI'll argue that even the 50% is understated. Why? Because first of all, not everyone will be on Reddit, just as not everyone will be on any other platform. Second of all, there are users who use Reddit once every few months, when they need someone's advice or opinion. These, once in a while users are not taken into these metrics.\n\nIn theory, the company can innovate, and bring new features, that attract more users, and the average time spent per user increases. Given that the platform doesn't change too much over time, I'll argue that the platform applies only to a certain type of user and is getting close to the ceiling when it comes to growing within the U.S.\n\nInternationally, on the other side, there is plenty of room to grow. However, as George Orwell said, \"All animals are equal, but some are more equal than others\".\n\nThis brings us to the 2nd part of the equation - average revenue per user.\n\nThe average U.S. user brings 4x more revenue than the average user from the rest of the world. So, although there is room to grow, it is less valuable.\n\n&amp;#x200B;\n\n**Future business model**\n\nThis is a good short summary of Reddit's main income stream, but it is backward-looking, and there is one more thing that we need to take into account. Its data.\n\nIt is fair to say that the platform is one of the internet's largest archives of human experiences and conversations, and this data definitely has value. It can be used for various reasons, including, training large language models. Pretty much the same day as filing the prospectus, Reddit and Google announced a partnership, that is expected to be worth $60 million per year. This is 8% of its 2023 revenue and I believe this revenue stream - licensing data - is what will create all the hype around the company. \n\nHere's why I think that:\n\n&amp;#x200B;\n\n**Analysis of financial statements**\n\nDespite being around for 19 years, Reddit is still struggling to find its way to profitability and loses around $100m per year. It can be argued that the company is poorly managed, and it reminds me of Twitter prior to the acquisition of Elon Musk, when the R&amp;D was incredibly high and couldn't be justified with the new features introduced by the platform.\n\nReddit's R&amp;D for 2023 was $438 million (55% of revenue). Of course, this is lagging, as in many cases, the value created from it is somewhere in the future. However, this isn't something new. Reddit has historically had high R&amp;D expenses. Whether this is justified or not, of course, you be the judge.\n\nIts revenue growth in 2023 was 20%, which isn't too exciting and can be barely labeled as a growth company. Especially considering there's not much room to grow in the U.S. and its international growth is less valuable.\n\n&amp;#x200B;\n\nThe expectation is that the valuation will be above $5 billion. The company has over $1.2 billion in cash and marketable securities and no debt apart from leases. Meaning, that the valuation of the business is above $3.8 billion. \n\nI'd argue with the current business model and lack of profitability, this cannot be justified. Its future value is highly dependent on the success of data licensing, a revenue stream, that we have very little information on.\n\n&amp;#x200B;\n\n**Why IPO?**\n\nHowever, the question \"Why IPO?\" has not been answered yet. The company is losing $100m per year and has over $1.2 billion in cash and marketable securities. This is sufficient to cover the losses for the foreseeable future. So, raising additional funds doesn't seem to be the main reason for the IPO.\n\nTwo reasons should be considered:\n\n1. **Liquidity for the existing shareholders** \\-  However, if the existing shareholders are pushing for this, it means they're not too optimistic about the company's future.\n2. Executive compensation - The CEO, for example, has over 660k PRSUs (Performance-restricted share units) that are eligible to vest when the company attains a $5b market cap valuation.\n\nIn my opinion, if the current shareholders believe in the company, they would be better off if the company remained private. So far, I am not convinced that the IPO adds any value to the company.\n\nBeing a public company brings quite some costs. The list of all costs, that is disclosed in the prospectus is yet to be completed, and there are also going to be additional ongoing expenses for being a public company, that will be incurred every single year.\n\n&amp;#x200B;\n\n**The IPO strategy**\n\nThe price of pretty much anything is a function of supply and demand. As Reddit doesn't need additional funds, I don't expect the company will issue too many additional shares. Rumors range from raising $100m to $750m. Now, if we focus on the demand, here's another red flag.\n\nQualified Reddit users and moderators will be invited to buy shares in the IPO, alongside other investors, through a directed share program. In my opinion, this is a psychological trick, making the users and moderators feel special so that they use this special offer to buy shares.\n\nIn addition, there will be shares offered through Fidelity Brokerage Services, SoFi, and Robinhood. So, if someone wants to buy into an IPO, they get a chance to do that. Basically, the goal is to increase demand as much as possible.\n\n&amp;#x200B;\n\n**Sam Altman**\n\nEntities affiliated with Sam Altman have 9.2% voting power. Yes, the  OpenAI Sam Altman.\n\nHave you seen the licensing deal between OpenAI and Reddit?  \nMe neither.\n\n&amp;#x200B;\n\n**Valuation**\n\nAnyway, one of the questions that many have is - Is Reddit going to be overvalued from the start? The answer to that question depends on your expectations for the data licensing model. Based on my estimates, the current advertising business model is worth around $1.7 billion.\n\nAdd the $1.2 billion of cash on top of it, and the valuation is close to $3 billion.\n\nOf course, I could be wrong in my estimates, but it is quite clear that the advertising business doesn't explain the $5 billion + valuation.\n\nSo, is the data licensing revenue stream worth more than $2 billion? This is one of the main questions that needs to be answered. As there is no past information, it is also the key piece of the puzzle to create hype around the company. I would not be surprised if more data licensing information followed before the IPO, which further increases the hype around the company.\n\nHowever, if Reddit can land many data licensing deals, then the $5 billion valuation can be justified.\n\n&amp;#x200B;\n\nI'd love to read your thoughts about the IPO, your thoughts on how much the data licensing stream is worth, as well as if there is something else that you find important, that I missed.",
        "created": "2024-02-28",
        "num_comments": 140,
        "ups": 171,
        "downs": 0,
        "score": 171,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b24tan/reddits_ipo_the_most_important_details_red_flags/"
    },
    {
        "id": "1b2cggq",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "What stock have you irrationally hang onto for a long time hoping it would explode?",
        "selftext": "Over the years Ive build a nice stock portfolio which was created by a few big bangs that offset some loosing positions. However in some cases I have the feeling I'm holding on too long to some stocks and they will never take off. \n\nIn my case:\n\nStock: CUV (ASX) or CLVLY:US\n\nTime held: 11 years\n\nBelief: \n\nClinuvel (CUV) is an obscure Australian Pharma stock. They are profitable because they provide a treatment for people with extreme light sensitivity (EPP) which is small but very profitable as they are the only treatment. Their medicine Scenesse (afamelanotide) basically makes you tanned, makes you loose appetite and gives you a hard-on (my personal experience). They are working on a treatment for vitiglio (I'm confident it will work) and stroke (unsure) which are much bigger markets. By now I had expected that big Pharma would have bought them out years ago but it hasn't happened and at this stage their is a large change current management will do something dumb with the cash on hand, hence I'm thinking of trimming my position because the stock has been going nowhere for years...\n\nI'm curious: what stock have you irrationally held for a  long time thinking it would take off but hasn't?\n\nDisclaimer: I own CUV and CLVLY stock",
        "created": "2024-02-28",
        "num_comments": 370,
        "ups": 96,
        "downs": 0,
        "score": 96,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b2cggq/what_stock_have_you_irrationally_hang_onto_for_a/"
    },
    {
        "id": "1b25qra",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "Apple Met With DOJ Antitrust Chief in Last-Ditch Bid to Avoid Expected Suit",
        "selftext": "# Apple Met With DOJ Antitrust Chief in Last-Ditch Bid to Avoid Expected Suit\n\n(Bloomberg) -- **Apple Inc. representatives met with the Justice Department last week in a final bid to persuade the agency not to file an antitrust suit against the company**, according to people familiar with the matter.\n\nThe company and its lawyers met with Assistant Attorney General Jonathan Kanter, who will make the final call on whether to file a suit, said the people, who asked not to be identified discussing the confidential meeting. Such “last rites” meetings are often one of the final steps before a lawsuit is filed.\n\nAntitrust enforcers, who have been probing the company since 2019, allege that Apple has imposed software and hardware limitations on its iPhones and iPads to impede rivals from effectively competing. The suit is expected in the coming weeks, likely by the end of March, the people said.\n\nApple didn’t immediately respond to a request for comment. The Justice Department declined to comment.\n\nApple’s App Store, which charges developers a commission of either 15% or 30%, has come under heavy criticism by developers and lawmakers.\n\nIn January, Apple said it will allow US developers to use alternative payment systems, but charge a 27% fee for most digital purchases or 12% on subscriptions. Epic Games Inc., which sued the company over its App Store policies, is contesting the proposed changes, saying they are inadequate and would effectively prevent developers from reducing consumer prices.\n\nIn an interview with Bloomberg News this month, California Attorney General Rob Bonta said the state was in touch with the Justice Department about the potential case and could join onto an eventual complaint.\n\n“We’re very interested in” possibly joining, Bonta said. “We are very aware of the federal government’s interest in Apple. We are interested also, and it’s very aligned with our overall strategy in the tech industry.”\n\nThe Justice Department has also been monitoring Apple’s moves in Europe as it prepares to begin enforcing new digital gatekeeper rules on March 7.\n\nTo comply with those rules, Apple said it will allow customers to download software from outside its App Store, use alternative payment systems and more easily choose a new default web browser. Yet several developer groups have slammed Apple’s proposed changes as “malicious compliance” with the EU’s rules, criticizing the iPhone maker for introducing new fees for payment processing and a €0.50 per app installation fee for software downloaded more than 1 million times. While Apple said most developers in the EU would see their payments decrease or stay the same, developers say the new fee will force them to stay within the App Store or face prohibitive payments.\n\nApple is expected to face a fine of at least €500 million ($542 million) by EU’s antitrust watchdog as soon as next week related to allegations it silenced music-streaming rivals, including Spotify Technology SA, on its platforms. The company separately offered to settle a second probe into its tap-to-pay technologies, by opening up access to its coveted near-field communication chip on iPhones to rival digital wallets.\n\n&amp;#x200B;\n\nsource;\n\n[https://www.bnnbloomberg.ca/apple-met-with-doj-antitrust-chief-in-last-ditch-bid-to-avoid-expected-suit-1.2040085](https://www.bnnbloomberg.ca/apple-met-with-doj-antitrust-chief-in-last-ditch-bid-to-avoid-expected-suit-1.2040085)\n\n[https://www.reuters.com/technology/apple-met-with-us-justice-department-bid-avoid-antitrust-lawsuit-bloomberg-2024-02-27/](https://www.reuters.com/technology/apple-met-with-us-justice-department-bid-avoid-antitrust-lawsuit-bloomberg-2024-02-27/)\n\nhttps://www.macrumors.com/2024/02/28/apple-met-justice-department-antitrust/",
        "created": "2024-02-28",
        "num_comments": 14,
        "ups": 93,
        "downs": 0,
        "score": 93,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b25qra/apple_met_with_doj_antitrust_chief_in_lastditch/"
    },
    {
        "id": "1b2jned",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "Paramount falls short on revenue but posts profit, strong streaming results",
        "selftext": "Paramount Global missed revenue expectations for the fourth quarter on Wednesday but posted a surprise quarterly profit and posted strong results from its streaming platform Paramount+.\n\nHere’s how Paramount performed in the fourth quarter compared to Wall Street estimates from LSEG, formerly known as Refinitiv:\n\nEarnings per share: 4 cents vs. an expected loss of 1 cent\n\nRevenue: $7.64 billion vs. $7.85 billion expected\n\nFor the last three months of 2023, Paramount reported a profit of $514 million, or 77 cents per share, up from $21 million, or 1 cent per share, the year prior. Adjusted for one-time items, earnings per share were 4 cents for the period.\n\nParamount — home to brands such as CBS, Showtime, BET, Nickelodeon and its namesake movie studio — reported a 6% year-over-year revenue decline but posted notable strides in its streaming segment.\n\nParamount+, its flagship streaming service, reached 67.5 million subscribers during the period, a net increase of 4.1 million, and recorded 69% revenue growth year over year. The company expects to achieve profitability for Paramount+ by 2025, it said Wednesday.\n\nSubscription revenue in the fourth quarter grew 43%, partially driven by price increases, and revenue across its entire direct-to-consumer segment grew 34%.\n\nParamount saw a 27% jump in global viewing hours across Paramount+ and Pluto TV during the fourth quarter.\n\n“Looking ahead, we continue to be focused on maximizing the return on our content investments and scaling streaming, while transforming the cost base of our business,” CEO Bob Bakish said in a press release. “And I couldn’t be more thrilled with the early momentum we’ve had across every platform in 2024, demonstrating the power of our strategy and assets.”\n\nParamount has been exploring sale options for all or parts of its business in recent months as the media landscape rapidly changes. Paramount has struggled without a solid growth narrative, with shares down more than 50% over the past two years.\n\nWarner Bros. Discovery had been in preliminary talks to acquire Paramount, but those talks have since halted, CNBC’s Alex Sherman reported Tuesday.\n\nParamount announced about 800 layoffs earlier this month, just a day after the company revealed it had reached record viewership numbers for this year’s Super Bowl.\n\nThe company on Wednesday reported its TV media revenue declined 12% year over year. Advertising revenue declined 15% due to overall “softness in the global advertising market and 5-percentage point impact from lower political advertising,” according to the earnings release.\n\nRevenue in Paramount’s filmed entertainment sector sank 31% year over year, driven by lower licensing revenue.\n\nSource: https://www.cnbc.com/2024/02/28/paramount-global-para-earnings-q4-2023.html",
        "created": "2024-02-28",
        "num_comments": 27,
        "ups": 96,
        "downs": 0,
        "score": 96,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b2jned/paramount_falls_short_on_revenue_but_posts_profit/"
    },
    {
        "id": "1b24v4l",
        "subreddit": "stocks",
        "upload_date": "2024-02-28",
        "title": "Baidu revenue grows 6% in fourth quarter as AI and advertising boost business",
        "selftext": "China’s Baidu said fourth-quarter revenue rose 6%, helped by gains from its artificial intelligence applications and a growing advertising business.\n\nFor the three months through December, the company reported revenue of 34.95 billion yuan ($4.92 billion), broadly in line with analysts’ average estimate of 34.97 billion yuan, according to LSEG data.\n\nThe company’s adjusted net income rose by 44% to 7.76 billion yuan, compared with 5.37 billion yuan for the same period a year earlier, beating analysts’ forecasts for 6.32 billion yuan.\n\nAs China’s largest internet search engine, Baidu makes the majority of its revenue from advertising. But as China’s economy slows and consumers spend less, Baidu has increasingly invested in AI. In March last year, it launched its ChatGPT-like ERNIE Bot in bid to capture from the potential of the technology.\n\nThe company said ERNIE AI services have already started to contribute to Baidu’s revenues.\n\n“Throughout 2023, we made significant strides in advancing ERNIE and ERNIE Bot, reinventing our products and services, and achieving breakthroughs in monetization.” Co-founder and CEO Robin Li said in a statement.\n\nThe U.S.-listed shares of the company rose by 0.4% in trading before the bell.\n\nBaidu’s online marketing revenue grew 6% to 19.2 billion yuan.\n\nFor the quarter, its adjusted profit was 21.86 yuan per American Depositary Share (ADS), compared with a profit of 15.25 yuan per share a year earlier.\n\nThis exceeded analysts’ average estimate of 17.87 yuan per ADS, according to LSEG.\n\nSource: https://www.cnbc.com/2024/02/28/baidu-q4-earnings-2023.html",
        "created": "2024-02-28",
        "num_comments": 9,
        "ups": 57,
        "downs": 0,
        "score": 57,
        "permalink": "https://www.reddit.com/r/stocks/comments/1b24v4l/baidu_revenue_grows_6_in_fourth_quarter_as_ai_and/"
    },
    {
        "id": "1b25400",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "BTC is up 17% the last 4.20 days. At this rate, another 17% in 4.20 days equals $69k",
        "selftext": "$69,420 soon",
        "created": "2024-02-28",
        "num_comments": 711,
        "ups": 4428,
        "downs": 0,
        "score": 4428,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b25400/btc_is_up_17_the_last_420_days_at_this_rate/"
    },
    {
        "id": "1b27snk",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "SNOW, AI, &amp; PARA earnings tonight. time to make it outta the hood",
        "selftext": "I shit the bed…… I didn’t deliver…… I fucked it……… \n\n[I know this is loss porn for ants, but im eurotrash so its actually a lot for me](https://preview.redd.it/yxew30qr8clc1.png?width=685&amp;format=png&amp;auto=webp&amp;s=55d4b767fe5eb47e9bee7d866ca405bbc1d53d96)\n\nToday is the day I'm gonna risk it all. I either become a legend or a martyr tonight. Failure is no longer an option; the ball has hit the ground, and the only choice is to bounce back or die trying. Today we have on the menu: Snowflake, Paramount, and C3 dot ai ( dot = . (reddit makes it a link lmao))\n\n \n\n1. **SNOW** \\- If there's one thing I have learned this earnings season, it’s that cloud stocks get slaughtered, whether they beat or miss earnings. Only a handful of cloud companies go up, and I am sure Snowflake isn’t one of them. It’s still a long way to go for Snowflake to become profitable. Take a look at their leadership; I can’t see a single face that doesn’t look younger than 50. This company is way overvalued as well, 77B market cap with a PE of -100??? Tonight I'm just following the trend of other cloud providers, and they all shit the bed after earnings, so I am shorting this company. Also, add to all this that Cramer is bullish on them…….\n2. **PARA** \\- Paramount makes some damn good movies: Godfather, Interstellar, Top gun, TWOWS, SPR, Shutter Island, KOTFM, and many more. I went to the cinema a couple of months ago to watch the new Mission Impossible in 4DX, and I had a blast. Warren Buffett sold his PARA holdings last quarter; we all know this boomer has lost his Midas touch by now, so I am very confident coming into earnings tonight. Tbh this play comes more from the heart than from the brain.\n3. **AI** \\- Honestly, this ticker says enough. Expect green dildos tonight\n\n[NOT TODAY!!!!!!!🤞](https://preview.redd.it/ttsagflv8clc1.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=027fc8e223353e91dd90e08e10c2faf1766cd4c2)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**tldr: AI &amp; PARA go up, SNOW go down**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nMy positions:\n\n[Using 5x leveraged CFD’s \\(europoor\\), $16.8K exposure. I am absolutely levered to the tits right now, I either make it or break it. If my account goes tits up tonight, expect to never hear from me again. I love you all. God bless](https://preview.redd.it/nbm09k0y8clc1.png?width=725&amp;format=png&amp;auto=webp&amp;s=bc5745d8a80389fe9439cb5bb6dd2aeef6106386)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*I am regarded, you will lose money by following me, this is by not financial advice, dont sue me, do your own research*\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nGod bless America",
        "created": "2024-02-28",
        "num_comments": 724,
        "ups": 2619,
        "downs": 0,
        "score": 2619,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b27snk/snow_ai_para_earnings_tonight_time_to_make_it/"
    },
    {
        "id": "1b2i386",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "It's really happening",
        "selftext": "We were wrong... it is a Wendy's ",
        "created": "2024-02-28",
        "num_comments": 203,
        "ups": 2356,
        "downs": 0,
        "score": 2356,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b2i386/its_really_happening/"
    },
    {
        "id": "1b2bc2f",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "From 0.5 BTC to 6 BITCOINS 🤌🏼",
        "selftext": "",
        "created": "2024-02-28",
        "num_comments": 293,
        "ups": 1732,
        "downs": 0,
        "score": 1732,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b2bc2f/from_05_btc_to_6_bitcoins/"
    },
    {
        "id": "1b2h822",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "NVDA is now worth more than Canada",
        "selftext": "",
        "created": "2024-02-28",
        "num_comments": 297,
        "ups": 1498,
        "downs": 0,
        "score": 1498,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b2h822/nvda_is_now_worth_more_than_canada/"
    },
    {
        "id": "1b1wxha",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "Dinner surge..",
        "selftext": "",
        "created": "2024-02-28",
        "num_comments": 48,
        "ups": 1251,
        "downs": 0,
        "score": 1251,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b1wxha/dinner_surge/"
    },
    {
        "id": "1b231if",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "It's over.",
        "selftext": "",
        "created": "2024-02-28",
        "num_comments": 115,
        "ups": 801,
        "downs": 0,
        "score": 801,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b231if/its_over/"
    },
    {
        "id": "1b1wbly",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "I have GOOGL $150 Calls for March 8 already up",
        "selftext": "",
        "created": "2024-02-28",
        "num_comments": 216,
        "ups": 734,
        "downs": 0,
        "score": 734,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b1wbly/i_have_googl_150_calls_for_march_8_already_up/"
    },
    {
        "id": "1b2kmuc",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "Any degens gonna short some baconators?",
        "selftext": "",
        "created": "2024-02-28",
        "num_comments": 72,
        "ups": 768,
        "downs": 0,
        "score": 768,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b2kmuc/any_degens_gonna_short_some_baconators/"
    },
    {
        "id": "1b2hls9",
        "subreddit": "wallstreetbets",
        "upload_date": "2024-02-28",
        "title": "SNOW, The Last Hail Mary Play",
        "selftext": "After getting destroyed during the previous FOMC week, I came across a post stating SNOW was primed for a beating and boy, were they right. I bought 4 3/1 180P for only $135 and this will be the first time options I’ve bought will be up 1000%+. Thank you kind user who posted their play BEFORE it happened. ",
        "created": "2024-02-28",
        "num_comments": 321,
        "ups": 646,
        "downs": 0,
        "score": 646,
        "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1b2hls9/snow_the_last_hail_mary_play/"
    },
    {
        "id": "1b2icl6",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "2 years ago After 7 years of losing money overall actively trading, I started putting all my extra investment money monthly into VOO only.",
        "selftext": "What a surprise, it's gone up exponentially since then. With no stress, anxiety, research, DD, waking up premarket to analyze charts.\nAll the time I spent doing that to lose money in the end. I do wish I would have accepted this advice sooner but some people have to learn the hard way and that's okay. I'm not saying it can't be done successfully but as everyone states, if you're young or just starting out, for the love of god just park it in an index fund and go enjoy your day. End rand",
        "created": "2024-02-28",
        "num_comments": 107,
        "ups": 204,
        "downs": 0,
        "score": 204,
        "permalink": "https://www.reddit.com/r/investing/comments/1b2icl6/2_years_ago_after_7_years_of_losing_money_overall/"
    },
    {
        "id": "1b1wnu2",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "Why not just buy VTSAX and leave it alone?",
        "selftext": "I'm curious as to why people aren't just buying an index fund like VTSAX with about 3800 companies inside of it, and is self-cleansing, so I would think it's just safe while giving a solid annual return over many years.\n\nI understand people may want better yields, a chance for better returns, or even diversity, but I'd like to hear what you have to say.",
        "created": "2024-02-28",
        "num_comments": 214,
        "ups": 159,
        "downs": 0,
        "score": 159,
        "permalink": "https://www.reddit.com/r/investing/comments/1b1wnu2/why_not_just_buy_vtsax_and_leave_it_alone/"
    },
    {
        "id": "1b2nbqn",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "Executive Chairman widely reported selling stock during blackout period for employees",
        "selftext": "Problem is what the thread title says.\n\nI work at a publicly listed company whose earnings report came out yesterday. We broke the billion dollar mark in revenue but it landed short of the expectations and our guidance for Q1 wasn’t as high as market expectations.\n\nStock dropped 15% today.\n\nOur executive chairman sold a combined 80k shares reportedly on Feb 2nd and Feb 5th. Totals around 3.2 million I believe. \n\nWe got the HR announcement email about the earnings call Jan 16th and they communicated a blackout period starting Jan 29th. Am I wrong to think this is a violation of some sort? ",
        "created": "2024-02-29",
        "num_comments": 29,
        "ups": 63,
        "downs": 0,
        "score": 63,
        "permalink": "https://www.reddit.com/r/investing/comments/1b2nbqn/executive_chairman_widely_reported_selling_stock/"
    },
    {
        "id": "1b2avee",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "Anyone else enjoying this ibit ETF ride?",
        "selftext": "Allocated 10% of my 401K to ibit ETF in January at a very low price. It’s been a crazy ride seeing ibit price shoot up with bitcoin. I’m at a good dilemma coming up. As I approach 100% ROI take the profits and leave the rest as house money or let it all ride? The logic says probably take the profits but man sure is tough to think about doing that as the returns keep going up. Anyway enjoying the ibit ETF ride, I hope many of you all out there are doing so as well!",
        "created": "2024-02-28",
        "num_comments": 69,
        "ups": 36,
        "downs": 0,
        "score": 36,
        "permalink": "https://www.reddit.com/r/investing/comments/1b2avee/anyone_else_enjoying_this_ibit_etf_ride/"
    },
    {
        "id": "1b26ziu",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "Why did Vanguard Retirement Fund tank immediately at the end of 2021 and not recover throughout 2022?",
        "selftext": "Looking at VTIVX in particular. Was this decline, and the lack of recovery that followed, just due to the pandemic?  \n\nIf so, why wouldn’t something like VTSAX have behaved the same way?  \n\nI’m mostly split between the two, but can’t help feeling like I should ditch the target fund.",
        "created": "2024-02-28",
        "num_comments": 15,
        "ups": 31,
        "downs": 0,
        "score": 31,
        "permalink": "https://www.reddit.com/r/investing/comments/1b26ziu/why_did_vanguard_retirement_fund_tank_immediately/"
    },
    {
        "id": "1b2j75h",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "Should I manage my own 401(k)?",
        "selftext": "I’m closing in on $100K in my 401(k) at 30yo. I’ve been contributing for 4 years. My entire 401(k) is currently invested in the Vanguard Target 2060 Fund. I was considering splitting my future contributions between this fund and an S&amp;P 500 Index fund. Thoughts? I’m open to suggestions of other changes I can make.",
        "created": "2024-02-28",
        "num_comments": 58,
        "ups": 19,
        "downs": 0,
        "score": 19,
        "permalink": "https://www.reddit.com/r/investing/comments/1b2j75h/should_i_manage_my_own_401k/"
    },
    {
        "id": "1b2au30",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "How liquid are US Treasuries?",
        "selftext": "So I'm probably going to be buying a home within the next 2 years, and a large percentage of my portfolio is stored in bonds and money market funds for this reason. Currently I have been doing revolving 1-2 month T Bills. However, considering that it could still be another two years before I buy anyhting, I would like to purchase some longer term bonds - namely, things that are 9-12 months away from maturity. \n\nIf I do this, realistically... I would be able to quickly sell them if I needed to, right?",
        "created": "2024-02-28",
        "num_comments": 31,
        "ups": 13,
        "downs": 0,
        "score": 13,
        "permalink": "https://www.reddit.com/r/investing/comments/1b2au30/how_liquid_are_us_treasuries/"
    },
    {
        "id": "1b2gz68",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "RothIRA Contribution with income limits.",
        "selftext": "Am I miss understanding the guidelines or something?\n\n“In 2024, the contribution limit is $7,000, or $8000 if you’re 50-plus. The Roth IRA income limits are 161k for single and 240k for those married filing jointly.”\n\nSo how is it that many “influencers” or “self made millionaire” are pushing this product when they don’t qualify? Or are they just pushing it to us “poor people”. Seems like people always leave out the income limits when talking about Roth.\n",
        "created": "2024-02-28",
        "num_comments": 4,
        "ups": 6,
        "downs": 0,
        "score": 6,
        "permalink": "https://www.reddit.com/r/investing/comments/1b2gz68/rothira_contribution_with_income_limits/"
    },
    {
        "id": "1b2np7k",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "Analyst and Price Targets are Bogus",
        "selftext": "There is a stock that I follow.   The price target is above and beyond what I could reasonably imagine for it.   What on earth do these analyst look at to pick their targets that isn't readily available to me?   \n\nMaybe I'm cynical but I treat all analyst views as marketing lies.   Are these people actually intelligent professionals or am I right in my thinking?   ",
        "created": "2024-02-29",
        "num_comments": 6,
        "ups": 7,
        "downs": 0,
        "score": 7,
        "permalink": "https://www.reddit.com/r/investing/comments/1b2np7k/analyst_and_price_targets_are_bogus/"
    },
    {
        "id": "1b2gepe",
        "subreddit": "investing",
        "upload_date": "2024-02-28",
        "title": "Owning bonds ETF vs build your own bonds portfolio",
        "selftext": "&amp;#x200B;\n\nReddit, I have a question about investing in bonds. When I personally buy bonds, I understand that I won't sell them at a loss if I choose short-term options because they mature within 1-3 months, and I will receive my initial investment plus the coupon. However, when it comes to investing in ETFs, like JNK,  it's unclear when I will be able to sell them with a profit, because of ETF volatility. Or price always drops for the dividend that was just paid? Can someone please explain this to me?  \n\n\n&amp;#x200B;\n\n  \n\n\n&amp;#x200B;",
        "created": "2024-02-28",
        "num_comments": 9,
        "ups": 7,
        "downs": 0,
        "score": 7,
        "permalink": "https://www.reddit.com/r/investing/comments/1b2gepe/owning_bonds_etf_vs_build_your_own_bonds_portfolio/"
    }
]